Repository: xweb3/blockscout
Catalog: apps/block_scout_web/priv/gettext/*/LC_MESSAGES/default.po
Languages: ja, ru

source: Type
ja: タイプ
ru: Тип

source: Type of the token standard
ja: トークン標準のタイプ
ru: Тип стандарта токена

source: UML diagram
ja: UML図
ru: Диаграмма UML

source: Uncle Reward
ja: おじさん報酬
ru: Дядя Награда

source: Uncles
ja: おじさんたち
ru: Дяди

source: Unconfirmed
ja: 未確認
ru: Не подтвержденный

source: Unique Token
ja: ユニークトークン
ru: Уникальный токен

source: Unique character string (TxID) assigned to every verified transaction.
ja: すべての検証されたトランザクションに割り当てられるユニークな文字列（TxID）。
ru: Уникальная строка символов (TxID), назначенная каждой проверенной транзакции.

source: Update
ja: アップデート
ru: Обновление

source: User defined maximum fee (tip) per unit of gas paid to validator for transaction prioritization.
ja: トランザクションの優先度付けのために検証者に支払われるガスの単位あたりのユーザー定義の最大手数料（チップ）です。
ru: Пользователь определяет максимальную плату (чаевые) за единицу газа, выплачиваемую валидатору для приоритезации транзакций.

source: User-defined tip sent to validator for transaction priority/inclusion.
ja: トランザクションの優先度/含まれるためのユーザー定義のチップがバリデータに送信されました。
ru: Пользовательский совет отправлен валидатору для приоритета/включения транзакции.

source: User-defined tips sent to validator for transaction priority/inclusion.
ja: トランザクションの優先度/含まれ方に関するユーザー定義のヒントが検証者に送信されました。
ru: Пользовательские подсказки, отправленные валидатору для приоритета/включения транзакции.

source: Validated
ja: 確認されたトランザクション
ru: проверенная транзакция

source: L1 State Batches
ja: L1 状態バッチ
ru: Пакеты состояния L1

source: Mantle DA Txn Batches
ja: マントル DA 取引 バッチ
ru: Мантийные пакеты транзакций DA Транзакции

source: L1 Txn Batches
ja: L1 トランザクションバッチ
ru: Л1 партии транзакций

source: L1 to L2 Txns
ja: L1からL2へのトランザクション
ru: Перевод с L1 на L2.

source: L1 to L2 Transactions
ja: L1からL2への取引
ru: Транзакции L1 на L2

source: L2 to L1 Transactions
ja: L2からL1への取引
ru: Транзакции от L2 до L1

source: State Batches
ja: ステートバッチ。
ru: Государственные партии.

source: Txn Batches
ja: 取引 バッチ
ru: Пакеты транзакций

source: Validated Transactions
ja: 承認された取引
ru: Проверенные транзакции

source: Validator Creation Date
ja: バリデータ作成日
ru: Дата создания валидатора

source: Validator Data
ja: バリデータデータ
ru: Валидатор данных

source: Validator Name
ja: バリデーター名
ru: Имя валидатора

source: Value
ja: 価値
ru: Значение

source: Value sent in the native token (and USD) if applicable.
ja: 適用される場合は、ネイティブトークンで送信された価値（およびUSD）です。
ru: Значение отправлено в знакомой токене (или долларах США, если применимо).

source: Verifed contracts, %{subnetwork}, %{coin}
ja: 検証済みの契約、%{サブネットワーク}、%{コイン}
ru: Проверенные контракты, %{subnetwork}, %{coin}

source: Verified
ja: 検証済み
ru: Проверенный.

source: Verified Contracts
ja: 検証済みの契約
ru: Проверенные контракты

source: Verified at
ja: 確認済み
ru: Проверено в

source: Verified contracts
ja: 検証された契約
ru: Проверенные контракты

source: Verified contracts - %{subnetwork} Explorer
ja: 検証された契約 - %{サブネットワーク}エクスプローラー
ru: Подтвержденные контракты - %{subnetwork} Explorer

source: Verify & Publish
ja: 検証して公開する
ru: Проверить и опубликовать

source: Verify & publish
ja: 検証して公開する
ru: Проверить и опубликовать

source: Verify the contract
ja: 契約を確認してください。
ru: Проверьте контракт.

source: Version
ja: バージョン
ru: Версия

source: Via Sourcify: Sources and metadata JSON file
ja: ソースファイ：ソースとメタデータのJSONファイル
ru: Через Sourcify: файлы исходного кода и метаданных в формате JSON

source: Via Standard Input JSON
ja: 標準入力 JSON 経由
ru: Через стандартный ввод JSON

source: Via flattened source code
ja: フラット化されたソースコードを介して
ru: Через сжатый исходный код.

source: Via multi-part files
ja: マルチパートファイルを介して
ru: Через многочастевые файлы.

source: View All Blocks
ja: すべてのブロックを表示する
ru: Просмотреть все блоки.

source: View Contract
ja: 契約を表示する
ru: Просмотреть контракт

source: View next block
ja: 次のブロックを表示
ru: Просмотреть следующий блок

source: View previous block
ja: 前のブロックを表示する
ru: Просмотреть предыдущий блок

source: View the account balance, transactions, and other data for %{address} on the %{network}
ja: 「%{network}」上で、%{address}のアカウント残高、取引履歴、およびその他のデータを表示します。」
ru: Просмотреть баланс счета, транзакции и другие данные для %{address} на сети %{network}.

source: View the transactions, token transfers, and uncles for block number %{block_number}
ja: ブロック番号%{block_number}の取引、トークンの転送、およびアンクルを表示してください。
ru: Просмотреть транзакции, передачу токенов и блоки-дяди для блока номер %{block_number}.

source: View the verified contracts on %{subnetwork}
ja: %{subnetwork}で検証された契約を表示する。
ru: Просмотрите подтвержденные контракты на %{subnetwork}

source: View transaction %{transaction} on %{subnetwork}
ja: 「%{subnetwork}」での取引「%{transaction}」を表示する。
ru: Просмотреть транзакцию %{transaction} на %{subnetwork}

source: Vyper
ja: バイパー
ru: Вайпер

source: Vyper contract
ja: バイパー契約
ru: Договор Vyper

source: Waiting for transaction's confirmation...
ja: 取引の確認を待っています...
ru: Ожидание подтверждения транзакции...

source: Wallet addresses
ja: ウォレットのアドレス
ru: Кошельки-адреса

source: Warning! Contract bytecode has been changed and doesn't match the verified one. Therefore, interaction with this smart contract may be risky.
ja: 警告！契約バイトコードが変更され、検証済みのものと一致しません。したがって、このスマート契約とのやり取りは危険です。
ru: Предупреждение! Байт-код контракта был изменен и не соответствует проверенному. Поэтому взаимодействие с этим смарт-контрактом может быть рискованным.

source: Watch list
ja: ウォッチリスト
ru: Список наблюдения.

source: We recommend using flattened code. This is necessary if your code utilizes a library or inherits dependencies. Use the
ja: 「フラット化されたコードの使用をおすすめします。これは、コードがライブラリを利用するか依存関係を継承している場合に必要です。以下のようにしてください」
ru: Мы рекомендуем использовать сглаженный код. Это необходимо, если ваш код использует библиотеку или наследует зависимости. Используйте следующие соглашения

source: Write
ja: 書く
ru: Написать

source: Write Contract
ja: 契約書を書く
ru: Напишите договор

source: Write Proxy
ja: プロキシを書きます。
ru: Напишите Proxy

source: Yes
ja: はい
ru: Да

source: You can create 3 API keys per account.
ja: アカウントごとに3つのAPIキーを作成することができます。
ru: Вы можете создать 3 ключа API для каждой учётной записи.

source: You can create up to 15 Custom ABIs per account.
ja: アカウントあたり最大15個のカスタムABIを作成できます。
ru: Вы можете создать до 15 пользовательских ABI для одного аккаунта.

source: You can request a public category tag which is displayed to all Blockscout users. Public tags may be added to contract or external addresses, and any associated transactions will inherit that tag. Clicking a tag opens a page with related information and helps provide context and data organization. Requests are sent to a moderator for review and approval. This process can take several days.
ja: あなたは、すべてのBlockscoutユーザーに表示されるパブリックカテゴリタグを要求することができます。パブリックタグは、コントラクトまたは外部アドレスに追加することができ、関連するすべてのトランザクションはそのタグが継承されます。タグをクリックすると、関連情報が表示され、コンテキストとデータの整理に役立ちます。リクエストは、審査を受けるためにモデレーターに送信されます。このプロセスには数日かかる場合があります。
ru: Вы можете запросить общедоступный тег категории, который отображается для всех пользователей Blockscout. Общедоступные теги могут быть добавлены к контрактным или внешним адресам, и любые связанные транзакции будут наследовать этот тег. Нажатие на тег открывает страницу с соответствующей информацией и помогает предоставить контекст и организацию данных. Запросы отправляются модератору на рассмотрение и утверждение. Этот процесс может занять несколько дней.

source: You don't have address tags yet
ja: まだアドレスタグがありません。
ru: У вас еще нет ярлыков адреса.

source: You don't have addresses on you watchlist yet
ja: まだウォッチリストに住所がありません。
ru: У Вас еще нет адресов в списке наблюдения на Вашем часах.

source: You don't have transaction tags yet
ja: あなたはまだ取引タグを持っていません。
ru: У вас еще нет тегов для транзакций.

source: Your name
ja: あなたの名前
ru: Ваше имя

source: Your name*
ja: あなたの名前*
ru: Ваше имя*

source: at
ja: で
ru: в

source: balance of the address
ja: 住所のバランス
ru: баланс адреса

source: burned for this transaction. Equals Block Base Fee per Gas * Gas Used.
ja: この取引で燃やされたガスは、ガス使用量に基づくブロックベース手数料と同等です。
ru: Сожжено за эту транзакцию. Базовая плата за блок на единицу газа * Использованный газ.

source: burned from transactions included in the block (Base fee (per unit of gas) * Gas Used).
ja: ブロックに含まれるトランザクションから焼かれた（ベース料金（ガスの単位当たり）* 使用されたガス）。
ru: сожжено от транзакций, включенных в блок (Базовая плата (за единицу газа) * Расход газа).

source: button
ja: ボタン
ru: кнопка

source: created
ja: 作成されました
ru: созданный

source: custom RPC
ja: カスタムRPC
ru: настраиваемый RPC

source: doesn't include ERC20, ERC721, ERC1155 tokens).
ja: (ERC20、ERC721、ERC1155 トークンは含まれません)
ru: не включает токены ERC20, ERC721, ERC1155).

source: elements are displayed
ja: 要素が表示されます
ru: элементы отображаются

source: fallback
ja: フォールバック
ru: резервный вариант

source: false
ja: 偽物
ru: ложный (lozhnyy)

source: here
ja: ここ
ru: здесь

source: here.
ja: ここ。
ru: здесь.

source: method Response
ja: メソッドレスポンス
ru: метод Ответа

source: of
ja: の
ru: из

source: page
ja: ページ
ru: страница

source: receive
ja: 受け取る
ru: получить

source: required
ja: 要求される
ru: требуется

source: true
ja: 本当
ru: истина

source: truffle flattener
ja: トリュフフラットナー
ru: трюфельный сплющиватель

source: Sign in
ja: サインイン
ru: Войти

source: Signed in as
ja: サインイン中
ru: Вход выполнен как

source: 1. If you have just submitted this transaction please wait for at least 30 seconds before refreshing this page.
ja: もし今この取引を送信したばかりなら、このページをリロードする前に少なくとも30秒間お待ちください。
ru: Если вы только что отправили эту транзакцию, пожалуйста, подождите не менее 30 секунд, прежде чем обновлять эту страницу.

source: 2. It could still be in the TX Pool of a different node, waiting to be broadcasted.
ja: 2. それはまだ別のノードのTXプールにあり、放送待ちの状態にあるかもしれません。
ru: 2. Она все еще может находиться в пуле TX другого узла, ожидая передачи.

source: 3. During times when the network is busy (i.e during ICOs) it can take a while for your transaction to propagate through the network and for us to index it.
ja: 3. ネットワークが混雑している時（例えばICO中）は、トランザクションがネットワークを伝播し、インデックス化されるまでに時間がかかることがあります。
ru: 3. В периоды повышенной нагрузки на сеть (например, во время ICO), может потребоваться время, чтобы ваша транзакция распространилась по сети и мы проиндексировали ее.

source: 4. If it still does not show up after 1 hour, please check with your sender/exchange/wallet/transaction provider for additional information.
ja: 4.もし1時間たっても表示されない場合は、送信者/取引所/ウォレット/トランザクションプロバイダーに追加情報を確認してください。
ru: 4. Если оно все еще не появляется через 1 час, пожалуйста, свяжитесь с вашим отправителем/обменником/кошельком/провайдером транзакций для получения дополнительной информации.

source: An unexpected error has occurred. Try reloading the page, or come back soon and try again.
ja: 予期せぬエラーが発生しました。ページを再読み込みしてみるか、または少し時間を置いてから再度お試しください。
ru: Произошла непредвиденная ошибка. Попробуйте перезагрузить страницу или вернитесь позже и попробуйте снова.

source: Back to home
ja: 家に帰る
ru: Вернуться домой

source: Internal server error
ja: 内部サーバーエラー
ru: Ошибка внутреннего сервера

source: Request cannot be processed
ja: リクエストは処理できません
ru: Запрос не может быть обработан

source: Sorry, we are unable to locate this transaction hash
ja: 申し訳ありませんが、このトランザクションハッシュを見つけることができませんでした
ru: Извините, мы не можем найти этот хеш транзакции

source: This page is no longer explorable! If you are lost, use the search bar to find what you are looking for.
ja: このページはもう探検できません！迷子の場合は、検索バーを使用して目的のものを見つけてください。
ru: Эта страница больше не может быть изучена! Если вы заблудились, используйте строку поиска, чтобы найти то, что вы ищете.

source: Your request contained an error, perhaps a mistyped tx/block/address hash. Try again, and check the developer tools console for more info.
ja: あなたのリクエストには誤りが含まれている可能性があります。tx/block/addressのハッシュが誤入力されているかもしれません。もう一度試して、より詳しい情報については開発者ツールコンソールをチェックしてください。
ru: Ваш запрос содержал ошибку, возможно, неправильно набранную хэш-сумму tx / block / address. Попробуйте еще раз и проверьте консоль инструментов разработчика для получения дополнительной информации.

source: L1 State Batch Index
ja: L1ステートバッチインデックス
ru: L1 индекс пакета состояния

source: L1 State Batch Index.
ja: L1 ステートバッチインデックス。
ru: Индекс партии состояний L1.

source: Back Home
ja: 帰宅
ru: Назад домой

source: DA Fee
ja: DA手数料
ru: Плата DA

source: DA Gas Price
ja: DA ガス価格
ru: Цена на газ DA

source: DA Gas Used
ja: DAガス使用済み
ru: DA Газ используется.

source: During times when the network is busy (i.e during ICOs) it can take a while for your transaction to propagate through the network and for us to index it.
ja: ネットワークが混雑している時（例えばICO中）は、あなたの取引がネットワーク内で伝搬し、インデックスが作成されるまで時間がかかる場合があります。
ru: Во время высокой загрузки сети (например, во время ICO) транзакция может долго распространяться через сеть и время индексации у нас может занять некоторое время.

source: Gas Price on L2
ja: L2のガソリン価格
ru: Цена на газ на L2

source: If it still does not show up after 1 hour, please check with your sender/exchange/wallet/transaction provider for additional information.
ja: もし1時間たっても表示されない場合は、さらに情報を確認するためにあなたの送信者/取引所/ウォレット/取引プロバイダーにお問い合わせください。
ru: Если через час ничего не появится, пожалуйста, свяжитесь с вашим отправителем/обменным пунктом/кошельком/провайдером транзакций, чтобы узнать дополнительную информацию.

source: If you have just submitted this transaction please wait for at least 30 seconds before refreshing this page.
ja: この取引を送信したばかりの場合、ページを更新する前に少なくとも30秒間お待ちください。
ru: Если вы только что отправили эту транзакцию, пожалуйста, подождите по крайней мере 30 секунд, прежде чем обновлять эту страницу.

source: Indicates by which contract was this Txn synced to Mantle Bridge
ja: このトランザクションは、どの契約と『Mantle Bridge』が同期されたかを示しています。
ru: Это указывает, с каким контрактом была синхронизирована эта транзакция на Mantle Bridge.

source: Indicates the L1-L2 transactions volume
ja: L1-L2取引量を示します。
ru: Указывает на объем транзакций L1-L2.

source: Invalid Transaction Hash
ja: 無効なトランザクションハッシュです。
ru: Неверный хэш-транзакции

source: It could still be in the TX Pool of a different node, waiting to be broadcasted.
ja: 異なるノードのTXプールにまだ残っている可能性があり、放送されるのを待っているかもしれません。
ru: Он все еще может находиться в TX-пуле другого узла, ожидая передачи.

source: L1 Fee
ja: L1料金
ru: L1 плата

source: L1 Fee Scalar
ja: L1の料金スカラー
ru: Коэффициент платы L1

source: L1 Gas Price
ja: L1ガス価格
ru: Цена на газ L1

source: L1 Gas Used
ja: L1ガス使用済み
ru: Использованный газ L1

source: L1 Origin Txn Hash
ja: L1オリジン取引ハッシュ
ru: L1 Исходный хэш транзакции

source: L1 State Root Submission Txn Hash
ja: L1状態ルート提出トランザクションのハッシュ値
ru: Хэш транзакции отправки корневого состояния L1

source: L2 Fee
ja: L2料金
ru: L2 плата

source: L2 to L1 Txns
ja: L2からL1へのトランザクション
ru: Перевод L2 на L1

source: Mantle is the first modular layer-2 blockchain, combining hyperscale performance with security from Ethereum. Mantle powers whatever builders can dream.
ja: Mantle、Ethereumのセキュリティと、ハイパースケールのパフォーマンスを組み合わせた最初のモジュラーレイヤー2ブロックチェーンです。マントルは、ビルダーが夢見るあらゆるものを駆動します。
ru: Mantle - это первый модульный блокчейн на уровне 2, который объединяет гипермасштабную производительность с безопасностью Ethereum. Мантл обеспечивает возможность реализации всех возможных идей разработчиков.

source: Sorry, We are unable to locate this transaction Hash
ja: 申し訳ありませんが、このトランザクションのハッシュを特定できません。
ru: Извините, мы не можем найти хэш данной транзакции.

source: There is no deposit Txn for this address.
ja: このアドレスには入金がありません。
ru: На этот адрес нет депозита.

source: There is no withdrawal Txn for this adress.
ja: このアドレスには引き出しはありません。
ru: Для этого адреса нету возможности снятия средств.

source: Total transaction fee spent on L1 and L2.
ja: L1とL2で支払われた取引手数料の合計。
ru: Общая комиссия за транзакции, потраченная на L1 и L2.

source: Transaction fee on layer2.
ja: レイヤー2における取引手数料。
ru: Комиссия за транзакцию на втором уровне.

source: is not a valid transaction hash
ja: 有効なトランザクションのハッシュではありません。
ru: не является действительным хешем транзакции

source: L1 Gas Price*L1 Gas Used*L1 Fee Scalar
ja: L1 ガス料金 * L1 ガス使用量 * L1 手数料スカラー
ru: Цена газа L1 * L1 Использованный газ * L1 Коэффициент комиссии

source: L1 Rollup Fee
ja: L1ロールアップ料金
ru: Комиссия за L1 Rollup

source: L2 Txn Fee
ja: L2トランザクション手数料
ru: Комиссия за транзакцию L2

source: Mantle DA Submission Hash
ja: マントルDA提出ハッシュ
ru: Подтверждение Мантла DA Хэш-значения

source: Mantle DA Txn
ja: マントル DA 取引
ru: Мантийная DA Транзакции

source: Mantle DA Txn Batch Index
ja: マントルDA 取引バッチインデックス
ru: Индекс пакетной транзакции Mantle DA

source: Mantle DA Txn Batch Index.
ja: マントルDA 取引バッチインデックス。
ru: Индекс партии Mantle DA Транзакции.

source: Contact Us
ja: お問い合わせ
ru: Свяжитесь с нами

source: Latest Transactions
ja: 最新取引履歴
ru: Последние транзакции

source: View all Mantle DA batches
ja: すべてのMantle DAバッチを表示する
ru: Просмотр всех пакетов Mantle DA

source: Latest Mantle DA Txn Batches
ja: 最新マントルDA 取引バッチ
ru: Последние партии транзакций Mantle DA

source: View all Transactions
ja: すべての取引を表示する
ru: Просмотреть все транзакции.

source: Latest L1->L2 Transactions
ja: 最新のL1->L2トランザクション
ru: Последние транзакции L1->L2

source: View all L1->L2 Transactions
ja: すべてのL1->L2取引を表示する
ru: Просмотреть все транзакции от L1 к L2

source: Block No
ja: ブロック番号
ru: "Блок №"

source: Queue Index
ja: キューインデックス
ru: Индекс очереди

source: L2 Txn Hash
ja: L2トランザクションハッシュ
ru: Хеш L2 Транзакции

source: Txn Type
ja: 取引タイプ
ru: Тип транзакции.

source: User Deposit
ja: ユーザーの入金
ru: Депозит пользователя

source: Tss Reward
ja: 報酬のTSS
ru: Награда Tss

source: L2 Txn Rollback
ja: L2 トランザクション ロールバック
ru: Откат L2 Транзакции

source: Age
ja: 年齢
ru: Возраст

source: L1 Txn Hash
ja: L1トランザクションハッシュ
ru: Хеш L1 Транзакции

source: Msg Nonce
ja: メッセージナンス
ru: Нонс сообщения

source: Time Left
ja: 残り時間
ru: Оставшееся время

source: Whole status about the L2-L1 withdrawal
ja: L2-L1の撤退に関する全体的な状況
ru: Полный статус о выводе L2-L1.

source: Waiting for Relay
ja: リレーを待っています。
ru: Ожидание Реле

source: Withdrawn on L2 but not ready for claim on L1
ja: L2で引き出したが、L1での請求には準備ができていません。
ru: Снят на уровне L2, но не готов для получения на L1.

source: Ready for Claim
ja: 請求準備完了
ru: Готово к получению.

source: Ready for claim on L1
ja: L1についての請求準備完了
ru: Готов к претензии по L1.

source: Claimed
ja: 主張されました
ru: Утвержденный

source: Withdrawal has been claimed on L1
ja: L1において引き出しが申請されました。
ru: Вывод был запрошен по L1

source: Batch Index
ja: バッチインデックス
ru: Индекс пакета (Batch Index)

source: Store Period(s)
ja: 店舗期間
ru: Период хранения(я)

source: DA Hash
ja: DAハッシュ
ru: DA Хэш

source: Store Number
ja: ストア番号
ru: Номер магазина

source: State Batch
ja: ステートバッチ
ru: Государственный партионный номер

source: Batch Size
ja: バッチサイズ
ru: Размер пакета

source: Pre Total Elements
ja: プレトータルエレメンツ
ru: Предварительные Все элементы.

source: Txn Batch
ja: 取引バッチ
ru: Транзакции партия

source: Holders Count
ja: ホルダーカウント
ru: Количество держателей

source: L1 Txn Origin
ja: L1トランザクション起点
ru: Происхождение L1 Транзакции

source: Total Supply
ja: 総供給量
ru: кол-во

source: You're already connected to
ja: すでに接続されています
ru: Вы уже подключены к

source: Address/Txn Hash/Block/Token/DA Hash
ja: アドレス/トランザクションハッシュ/ブロック/トークン/DAハッシュ
ru: Адрес/Хэш транзакции/Блок/Токен/Хэш данных аккаунта

source: add custom chain failed,
ja: カスタムチェーンの追加に失敗しました,
ru: Ошибка при добавлении пользовательской цепи,

source: Token name or symbol
ja: トークン名またはシンボル
ru: Имя токена или символа

source: More Details
ja: 詳細情報
ru: Больше деталей

source: Hide Details
ja: 詳細を非表示にする
ru: Скрыть детали

source: Mimics Ethereum JSON RPC's eth_getBalance. Returns the balance as of the provided block (defaults to latest)
ja: イーサリアムのJSON RPCのeth_getBalanceを模倣しています。指定されたブロック時点の残高を返します（デフォルトは最新）
ru: Моделирует eth_getBalance в JSON RPC Ethereum. Возвращает баланс на указанном блоке (по умолчанию - последний)

source: Either the block number as a string, or one of latest, earliest or pending latest will be the latest balance in a *consensus* block. earliest will be the first recorded balance for the address. pending will be the latest balance in consensus *or* nonconcensus blocks.
ja: ブロック番号を文字列として指定するか、latest、earliest、またはpending latestのいずれかを指定します。最新の残高は合意形成ブロックに存在します。earliestはそのアドレスの最初に記録された残高となります。pendingは合意形成または非合意形成ブロック内の最新の残高となります。
ru: Можно указать номер блока в виде строки или одно из значений latest, earliest или pending latest. Самый последний баланс будет находиться в блоке консенсуса. earliest будет первым записанным балансом для данного адреса. pending будет самым последним балансом в блоках консенсуса или неконсенсуса.

source: Get balance for address. Also available through a GraphQL 'addresses' query. If the balance hasn't been updated in a long time, we will double check with the node to fetch the absolute latest balance. This will not be reflected in the current request, but once it is updated, subsequent requests will show the updated balance. If you want to know whether or not we are checking for another balance, use the `balancemulti` action. That contains a property called `stale` that will let you know to recheck that balance in the near future.
ja: アドレスの残高を取得します。また、GraphQLの「addresses」クエリを介しても利用できます。残高が長い間更新されていない場合、最新の絶対残高を取得するためにノードで二重チェックを行います。これは現在のリクエストに反映されませんが、一度更新されると、その後のリクエストで更新された残高が表示されます。別の残高をチェックしているかどうかを知りたい場合は、balancemultiアクションを使用してください。それにはstaleというプロパティが含まれており、近い将来その残高を再確認する必要があることを示します。
ru: Получить баланс для адреса. Также доступно через запрос GraphQL 'addresses'. Если баланс долгое время не обновлялся, мы будем дважды проверять с узлом, чтобы получить самый актуальный баланс. Это не будет отражено в текущем запросе, но после его обновления последующие запросы будут показывать обновленный баланс. Если вы хотите узнать, проверяем ли мы другой баланс, используйте действие 'balancemulti'. Оно содержит свойство 'stale', которое позволит вам знать о необходимости повторной проверки этого баланса в ближайшем будущем.

source: Display %{number} result
ja: %{number} つの結果を表示する
ru: Отображение %{number} результата

source: Found %{number} matching results for
ja: %{number} 件の一致する結果が見つかりました
ru: Найдено %{number} совпадающих результатов для

source: More blocks come in, click for an update
ja: さらにブロックが入ってきました、アップデートのためにクリックしてください
ru: Появляются новые блоки, нажмите для обновления

source: More internal transactions come in, click for an update
ja: さらに内部取引が入ってきました、アップデートのためにクリックしてください
ru: Появляются новые внутренние транзакции, нажмите для обновления

source: More transactions come in, click for an update
ja: さらに取引が入ってきました、アップデートのためにクリックしてください
ru: Поступают новые транзакции, нажмите для обновлени

source: More validations come in, click for an update
ja: さらに検証が入ってきました、アップデートのためにクリックしてください
ru: Поступают новые проверки, нажмите для обновления

source: Tools
ja: ツール
ru: инструменты

source: Token Approval Checker
ja: トークン承認チェッカー
ru: Проверка подтверждения токена

source: Display {number} result
ja: {number} つの結果を表示する
ru: Отображение {number} результата

source: Found {number} matching results for
ja: {number} 件の一致する結果が見つかりました
ru: Найдено {number} совпадающих результатов для
