Repository: xweb3/blockscout
Catalog: apps/block_scout_web/priv/gettext/*/LC_MESSAGES/default.po
Languages: ja, ru

source: Get balance for multiple addresses. Also available through a GraphQL 'addresses' query. If the balance hasn't been updated in a long time, we will double check with the node to fetch the absolute latest balance. This will not be reflected in the current request, but once it is updated, subsequent requests will show the updated balance. You can know that this is taking place via the `stale` attribute, which is set to `true` if a new balance is being fetched.
ja: 複数のアドレスの残高を取得してください。また、GraphQLの「addresses」クエリを介しても利用できます。残高が長い間更新されていない場合、ノードに対して最新の絶対的な残高を取得するために二重チェックを行います。これは現在のリクエストには反映されませんが、一度更新されると、後続のリクエストで更新された残高が表示されます。新しい残高が取得されている場合、`stale`属性が`true`に設定されることでこの処理が行われていることを知ることができます。
ru: Получить баланс для нескольких адресов. Также доступно через запрос на языке GraphQL 'addresses'. Если баланс не был обновлен в течение длительного времени, мы проверим с узлом, чтобы получить абсолютно последний баланс. Это не будет отражено в текущем запросе, но после обновления последующие запросы будут показывать обновленный баланс. Вы можете узнать, что это происходит через атрибут `stale`, который устанавливается в `true`, если запрашивается новый баланс.

source: Get pending transactions by address.
ja: アドレスによって保留中の取引を取得してください。
ru: Получить ожидающие транзакции по адресу.

source: Get transactions by address. Up to a maximum of 10,000 transactions. Also available through a GraphQL 'address' query.
ja: アドレスを指定して取引を取得します。最大で10,000件の取引まで可能です。GraphQLの「address」クエリでも利用できます。
ru: Получить транзакции по адресу. Доступно до 10 000 транзакций. Также можно получить через запрос 'address' в GraphQL.

source: Get internal transactions by transaction or address hash. Up to a maximum of 10,000 internal transactions. Also available through a GraphQL 'transaction' query.
ja: トランザクションまたはアドレスのハッシュによって内部トランザクションを取得します。最大で10,000件の内部トランザクションまで取得可能です。また、GraphQLの「transaction」クエリでも利用できます。
ru: Получите внутренние транзакции по хэшу транзакции или адресу. Максимально возможное количество внутренних транзакций составляет 10 000. Доступно также через запрос GraphQL 'transaction'.

source: Get token transfer events by address. Up to a maximum of 10,000 token transfer events. Also available through a GraphQL 'token_transfers' query.
ja: アドレスごとにトークンの送金イベントを取得します。最大10,000件のトークン送金イベントまで取得可能です。また、GraphQLの 'token_transfers' クエリでも利用可能です。
ru: Получите события передачи токена по адресу. Доступно до максимум 10 000 событий передачи токена. Также доступно через запрос GraphQL 'token_transfers'.

source: Get token account balance for token contract address.
ja: トークンコントラクトアドレスのトークンアカウント残高を取得してください。
ru: Получить баланс токенов для адреса контракта токена.

source: Get list of tokens owned by address.
ja: アドレスが所有するトークンのリストを取得する。 (Adoresu ga shoyū suru tōkun no risuto o shutoku suru.)
ru: Получите список жетонов, принадлежащих адресу.

source: Get list of blocks mined by address.
ja: アドレスで採掘されたブロックのリストを取得してください。
ru: Получить список блоков, смайненных с использованием данного адреса.

source: Get a list of accounts and their balances, sorted ascending by the time they were first seen by the explorer.
ja: エクスプローラーで最初に表示された時刻の昇順でソートされたアカウントと残高のリストを入手してください。
ru: Получите список счетов и их балансов, отсортированный по возрастанию времени, когда они были впервые обнаружены исследователем.

source: Get event logs for an address and/or topics. Up to a maximum of 1,000 event logs.
ja: 指定したアドレスやトピックに関するイベントログを取得します。最大1,000件のイベントログまで対応しています。
ru: Получите журналы событий для адреса и/или тем. До максимально 1 000 журналов событий.

source: Get <a href='https://github.com/ethereum/EIPs/issues/20'>ERC-20</a> or <a href='https://github.com/ethereum/EIPs/issues/721'>ERC-721</a> token by contract address.
ja: 契約アドレスによって<a href='https://github.com/ethereum/EIPs/issues/20'>ERC-20</a>または<a href='https://github.com/ethereum/EIPs/issues/721'>ERC-721</a>トークンを取得してください。
ru: Получите токен <a href='https://github.com/ethereum/EIPs/issues/20'>ERC-20</a> или <a href='https://github.com/ethereum/EIPs/issues/721'>ERC-721</a> по адресу контракта.

source: Get token holders by contract address.
ja: 契約アドレスによってトークンの保有者を取得します。
ru: Получить владельцев токенов по адресу контракта.

source: Get <a href='https://github.com/ethereum/EIPs/issues/20'>ERC-20</a> or <a href='https://github.com/ethereum/EIPs/issues/721'>ERC-721</a> token total supply by contract address.
ja: 契約アドレスから<a href='https://github.com/ethereum/EIPs/issues/20'>ERC-20</a>または<a href='https://github.com/ethereum/EIPs/issues/721'>ERC-721</a>トークンの総供給量を取得してください。
ru: Получить общую эмиссию токенов <a href='https://github.com/ethereum/EIPs/issues/20'>ERC-20</a> или <a href='https://github.com/ethereum/EIPs/issues/721'>ERC-721</a> по адресу контракта.

source: Get total supply in Wei from exchange.
ja: 取引所からウェイ単位の総供給量を取得してください。 (Torihikijo kara wei tan'i no sōkyūryō o shutoku shite kudasai.)
ru: Получите общее предложение в Вэях с биржи.

source: Get total supply in Wei from DB.
ja: DBからウェイ単位の総供給量を取得してください。
ru: Получить общий объем в Вей из БД.

source: Get total coin supply from DB minus burnt number.
ja: データベースから総コイン供給量を取得し、焼却された数を差し引いてください。
ru: Получите общую монетную эмиссию из БД, вычтите число сожженных.

source: Get latest price of native coin in USD and BTC.
ja: USDとBTCでのネイティブコインの最新価格を取得してください。
ru: Получите последнюю цену местной криптовалюты в долларах США и биткойнах.

source: Gets total transaction fees in Wei are paid by users to validators per day.
ja: 1日あたり、ユーザーがバリデータへ支払うウェイ単位の合計トランザクション手数料を取得します。
ru: Получает общую сумму комиссий за транзакции в веях, оплаченных пользователями валидаторам в день.

source: Mimics Ethereum JSON RPC's eth_blockNumber. Returns the lastest block number
ja: イーサリアムのJSON RPCのeth_blockNumberと同様の機能を持つものです。最新のブロック番号を返します。
ru: Метод эмулирует эфириум JSON RPC eth_blockNumber. Возвращает номер последнего блока.

source: Get block reward by block number.
ja: ブロック番号によってブロック報酬を取得してください。
ru: Получить вознаграждение за блок по его номеру.

source: Get Block Number by Timestamp.
ja: 時間スタンプによってブロック番号を取得します。
ru: Получить номер блока по метке времени.

source: Get a list of contracts, sorted ascending by the time they were first seen by the explorer. If you provide the filters `not_decompiled`(`4`) or `not_verified(4)` the results will not be sorted for performance reasons.
ja: 一覧を取得し、契約書を探査者によって最初に見つけられた時間で昇順にソートします。フィルター「not_decompiled（4）」または「not_verified（4）」を指定すると、パフォーマンスのために結果はソートされません。
ru: Получите список контрактов, отсортированный по возрастанию времени, когда они были первоначально обнаружены исследователем. Если вы используете фильтры `not_decompiled` (`4`) или `not_verified` (`4`), результаты не будут отсортированы в целях повышения производительности.

source: Get ABI for verified contract. Also available through a GraphQL 'addresses' query.
ja: 検証済み契約のABIを取得してください。また、GraphQLの 'addresses' クエリを使用しても取得できます。
ru: Получите ABI для проверенного контракта. Также доступно через запрос GraphQL 'addresses'.

source: Get transaction info.
ja: トランザクション情報を取得します。
ru: Получить информацию о транзакции.

source: Get transaction receipt status. Also available through a GraphQL 'transaction' query.
ja: 取引レシートのステータスを取得してください。また、GraphQLの「transaction」クエリでも利用できます。
ru: Получить статус квитанции о транзакции. Доступно также через запрос GraphQL 'transaction'.

source: Get error status and error message. Also available through a GraphQL 'transaction' query.
ja: エラーのステータスとエラーメッセージを取得してください。また、GraphQLの「トランザクション」クエリを通じても利用可能です。
ru: Получите статус ошибки и сообщение об ошибке. Также доступно через запрос GraphQL с использованием 'transaction'.

source: Display with gwei on Mantle, converted from L1 gas price
ja: マントル上のGweiで表示され、L1ガス価格から変換されたものを表示します

source: Get contract source code for verified contract. Also available through a GraphQL 'addresses' query.
ja: 検証済み契約の契約ソースコードを入手してください。また、GraphQLの「addresses」クエリでも利用可能です。

source: Verify a contract with Standard input JSON file. Its interface the same as <a href="https://docs.etherscan.io/tutorials/verifying-contracts-programmatically">Etherscan</a>'s API endpoint <br/> <br/>
ja: 標準入力JSONファイルで契約を確認します。そのインターフェースは、<a href="https://docs.etherscan.io/tutorials/verifying-contracts-programmatically">Etherscan</a>のAPIエンドポイントと同じです<br/> <br/>

source: Return status of the verification attempt (works in addition to verifysourcecode method)
ja: 検証試行の結果のステータス（verifysourcecodeメソッドに加えて機能します）の返却

source: The address of the account.
ja: アカウントの住所。

source: A 160-bit code used for identifying accounts.
ja: アカウントを識別するために使用される160ビットのコード。 (Akounto o shikibetsu suru tame ni shiyo sa reru 160-bitto no kōdo.)

source: A 160-bit code used for identifying accounts. Separate addresses by comma. Maximum of 20 addresses.
ja: アカウントを識別するために使用される160ビットのコード。アドレスはコンマで区切ってください。最大20個のアドレス。

source: Transaction hash. Hash of contents of the transaction. A transaction hash or address hash is required.
ja: トランザクションハッシュ。トランザクションの内容のハッシュ値です。トランザクションハッシュまたはアドレスハッシュが必要です。

source: A nonnegative integer that represents the starting block number. The use of 'latest' is also supported.
ja: 開始ブロック番号を表す非負の整数。'latest' の使用もサポートされています。

source: A nonnegative integer that represents the ending block number. The use of 'latest' is also supported.
ja: 終了ブロック番号を表す非負整数。 'latest'の使用もサポートされています。

source: A 160-bit code used for identifying contracts. An address and/or topic{x} is required.
ja: 契約を識別するために使用される160ビットのコード。アドレスと/またはトピック{x}が必要です。

source: A string equal to the first topic. A topic{x} and/or address is required.
ja: 最初のトピックに等しい文字列。 トピック{x}と/またはアドレスが必要です。

source: A 160-bit code used for identifying contracts.
ja: 契約を識別するために使用される160ビットのコード。

source: day in ISO 8601 format (yyyy-mm-dd)
ja: 日付をISO 8601形式（yyyy-mm-dd）で表現する。

source: A nonnegative integer that represents the json rpc request id.
ja: json rpcリクエストIDを表す非負整数。

source: A nonnegative integer that represents the block number.
ja: ブロック番号を表す非負整数。

source: A nonnegative integer that represents the block timestamp (Unix timestamp in seconds).
ja: ブロックタイムスタンプを表す0以上の整数（秒単位のUnixタイムスタンプ）。

source: Direction to find the closest block number to given timestamp. Available values: before/after.
ja: 指定されたタイムスタンプに最も近いブロック番号を見つけるための手順です。利用可能な値は、before（前方）とafter（後方）です。

source: The address of the contract.
ja: 契約の住所

source: The name of the contract.
ja: 契約の名前。

source: The compiler version for the contract.
ja: 契約のコンパイラーバージョン

source: Whether or not compiler optimizations were enabled.
ja: コンパイラの最適化が有効化されているかどうか。

source: The source code of the contract.
ja: 契約のソースコード。

source: Format of sourceCode(supported only "solidity-standard-json-input")
ja: 「ソースコードの形式は、「solidity-standard-json-input」のみサポートされます。」

source: The name of the contract. It could be empty string(""), just contract name("ContractName"), or filename and contract name("contracts/contract_1.sol:ContractName")
ja: 契約の名前。それは空の文字列("")、契約名だけ("契約名")、またはファイル名と契約名("contracts/contract_1.sol:契約名")かもしれません。

source: A string used for identifying verification attempt
ja: 検証試行で使用される文字列

source: Transaction hash. Hash of contents of the transaction.
ja: トランザクションハッシュ。トランザクション内容のハッシュです。

source: A nonnegative integer that represents the page number to be used for pagination. 'offset' must be provided in conjunction.
ja: ノンネガティブな整数で、ページネーションに使用するページ番号を表します。「offset」は併用する必要があります。

source: A nonnegative integer that represents the maximum number of records to return when paginating. 'page' must be provided in conjunction.
ja: ページネーション時に返すレコードの最大数を表す非負整数です。'page'は必ず指定する必要があります。

source: A string representing the order by block number direction. Defaults to descending order. Available values: asc, desc
ja: 注文するときのブロックの方向を表す文字列。デフォルトは降順です。利用可能な値は asc、desc です。

source: A nonnegative integer that represents the starting block number.
ja: 始まりのブロック番号を表す非負整数。

source: A nonnegative integer that represents the ending block number.
ja: 終了ブロック番号を表す非負の整数。

source: A string representing the field to filter by. If none is given it returns transactions that match to, from, or contract address. Available values: to, from
ja: フィルタリングするフィールドを表す文字列。指定されていない場合は、宛先、送信元、または契約アドレスに一致するトランザクションが返されます。利用可能な値: 宛先、送信元

source: Represents the starting block timestamp.
ja: スターティングブロックのタイムスタンプを表します。

source: Represents the ending block timestamp.
ja: 終了ブロックのタイムスタンプを表します。

source: A 160-bit code used for identifying accounts. An address hash or transaction hash is required.
ja: アカウントを識別するために使用される160ビットのコードです。アドレスハッシュまたはトランザクションハッシュが必要です。

source: A string representing the order by block number direction. Defaults to ascending order. Available values: asc, desc. WARNING: Only available if 'address' is provided.
ja: オーダーバイブロック番号の方向を表す文字列。デフォルトは昇順です。利用可能な値：asc、desc。警告：'address'が提供された場合にのみ利用可能です。

source: A nonnegative integer that represents the starting block number. WARNING: Only available if 'address' is provided.
ja: 開始ブロック番号を表す非負整数。注意：「address」が提供されている場合にのみ利用可能です。

source: A nonnegative integer that represents the ending block number. WARNING: Only available if 'address' is provided.
ja: アドレスが提供されている場合にのみ利用可能な終了ブロック番号を表す非負整数。

source: A nonnegative integer that represents the page number to be used for pagination. 'offset' must be provided in conjunction. WARNING: Only available if 'address' is provided.
ja: ページ送りに使用するページ番号を表す非負の整数。 'オフセット'は、住所が提供される場合にのみ指定する必要があります。注意： 'アドレス'が提供されている場合にのみ利用可能です。

source: A nonnegative integer that represents the maximum number of records to return when paginating. 'page' must be provided in conjunction. WARNING: Only available if 'address' is provided.
ja: ページネーション時に返すレコードの最大数を表す非負整数です。'page'は必ず提供される必要があります。警告: 'address'が提供されている場合のみ利用可能です。

source: A string representing the order by block number direction. Defaults to ascending order. Available values: asc, desc
ja: ブロックナンバーの方向を表す文字列。デフォルトは昇順です。利用可能な値：asc, desc

source: A string equal to the second topic. A topic{x} and/or address is required.
ja: 2番目のトピックに等しい文字列です。トピック{x}と/またはアドレスが必要です。

source: A string equal to the fourth topic. A topic{x} and/or address is required.
ja: 第四のトピックに等しい文字列。 トピック{x}と/またはアドレスが必要です。

source: A string equal to the third topic. A topic{x} and/or address is required.
ja: 第三のトピックに等しい文字列です。トピック{x}と/またはアドレスが必要です。

source: A string representing the and|or operator for topic0 and topic1. Required if topic0 and topic1 is used. Available values: and, or
ja: topic0およびtopic1のための論理演算子を表す文字列。topic0とtopic1が使用される場合に必要です。利用可能な値：and、or

source: A string representing the and|or operator for topic0 and topic2. Required if topic0 and topic2 is used. Available values: and, or
ja: トピック0とトピック2のand|or演算子を表す文字列です。トピック0とトピック2が使用される場合に必要です。利用可能な値は、andとorです。

source: A string representing the and|or operator for topic0 and topic3. Required if topic0 and topic3 is used. Available values: and, or
ja: トピック0とトピック3のためのand|orオペレーターを表す文字列。トピック0とトピック3が使用される場合に必要です。利用可能な値：and、or。

source: A string representing the and|or operator for topic1 and topic2. Required if topic1 and topic2 is used. Available values: and, or
ja: トピック1およびトピック2に対するand|or演算子を表す文字列。トピック1およびトピック2が使用される場合に必要です。利用可能な値：and、or

source: string representing the and|or operator for topic1 and topic3. Required if topic1 and topic3 is used. Available values: and, or
ja: トピック1とトピック3のためのand|or演算子を表す文字列。トピック1とトピック3が使用される場合に必要です。利用可能な値：and、or

source: A string representing the and|or operator for topic1 and topic3. Required if topic1 and topic3 is used. Available values: and, or
ja: トピック1とトピック3のand|or演算子を表す文字列です。トピック1とトピック3が使用される場合に必要です。利用可能な値は、andとorです。

source: A string representing the and|or operator for topic2 and topic3. Required if topic2 and topic3 is used. Available values: and, or
ja: トピック2およびトピック3のandまたはor演算子を表す文字列。トピック2およびトピック3が使用される場合に必要です。利用可能な値：and、or

source: The constructor argument data provided.
ja: 提供されたコンストラクタ引数データ。

source: Whether or not automatically detect constructor argument.
ja: 自動的にコンストラクタ引数を検出するかどうか。

source: The EVM version for the contract.
ja: 契約のEVMバージョン。

source: The number of optimization runs used during compilation
ja: コンパイル中に使用される最適化ランの数

source: The name of the first library used.
ja: 最初に使用された図書館の名前。

source: The address of the first library used.
ja: 最初に使用された図書館の住所。

source: The name of the second library used.
ja: 使用された2番目の図書館の名前。

source: The address of the second library used.
ja: 使用された2番目の図書館の住所

source: The name of the third library used.
ja: 第三の図書館の名前。

source: The address of the third library used.
ja: 使用された第3の図書館の住所。

source: The name of the fourth library used.
ja: 第四図書館の名前。

source: The address of the fourth library used.
ja: 第四図書館の住所

source: Array with sources and metadata files
ja: ソースとメタデータファイルを持つ配列

source: A nonnegative integer that represents the log index to be used for pagination.
ja: ページネーションに使用するログのインデックスを表す非負整数。

source: verified|decompiled|unverified|not_decompiled|empty, or 1|2|3|4|5 respectively. This requests only contracts with that status
ja: 「verified|decompiled|unverified|not_decompiled|empty」と「1|2|3|4|5」というのは、それぞれ以下の状態の契約のみを要求します。

source: Ensures that none of the returned contracts were decompiled with the provided version. Ignored unless filtering for decompiled contracts.
ja: 提供されたバージョンで分解された契約が返されていないことを保証します。分解された契約をフィルタリングする場合にのみ無視されます。

source: Represents the starting timestamp when contracts verified. Taking into account only with `verified` filter.
ja: 契約が確認された時点の開始タイムスタンプを表します。`verified`フィルターのみを考慮しています。

source: Represents the ending timestamp when contracts verified. Taking into account only with `verified` filter.
ja: `verified`フィルターのみを考慮して、契約が検証された場合の終了タイムスタンプを表します。

source: The `earliest` parameter will not work as expected currently, because genesis block balances are not currently imported
ja: 「earliest」パラメータは現在予想通りに機能しません。なぜなら、ジェネシスブロックの残高が現在インポートされていないためです。

source: Will never return more than 1000 log entries. For this reason, you can use pagination options to request the next page. Pagination options params: {"logIndex": "3D", "blockNumber": "6423AC", "transactionIndex": 53} which include parameters from the last log received from the previous request. These three parameters are required for pagination.
ja: 1000以上のログエントリを戻すことはありません。そのため、次のページをリクエストするためにページネーションオプションを使用できます。ページネーションオプションパラメータ: {"logIndex": "3D", "blockNumber": "6423AC", "transactionIndex": 53} は、前回のリクエストで受け取った最後のログからのパラメータを含んでいます。これらの3つのパラメータはページネーションに必要です。

source: The filter options
ja: フィルターオプション

source: 20 Bytes - address to check for balance
ja: 20バイト - 残高を確認するアドレス

source: Integer block number, or the string "latest", "earliest" or "pending"
ja: 整数ブロック番号、または文字列 "最新"、"最古"、または "保留中"

source: seconds
ja: 秒

source: Accepted on L2
ja: L2で受け付けられました

source: Accepted on L1
ja: L1まで巻き上げる

source: Finalized on L1
ja: L1で最終決定

source: Challenge Period Passed
ja: チャレンジ期間が終了しました

source: Txn Hash
ja: トランザクションハッシュ

source: ABI
ru: ABI (Abdominal Bracing Index) - ABI (Индекс брейсинга брюшной полости)

source: Tx/day
ru: Тх / день
