Repository: xweb3/blockscout
Catalog: apps/block_scout_web/priv/gettext/*/LC_MESSAGES/default.po
Languages: ja, ru

source: Log Data
ja: ログデータ
ru: Данные журнала

source: Log Index
ja: ログインデックス
ru: Индекс журнала

source: Logs
ja: ログ
ru: Бревна

source: Main Networks
ja: メインネットワークス
ru: Основные сети

source: Market Cap
ja: 時価総額
ru: Рыночная капитализация

source: Market cap
ja: マーケットキャップ
ru: рыночная капитализация

source: Max Fee per Gas
ja: ガスごとの最大手数料
ru: Максимальная плата за каждый газ.

source: Max Priority Fee per Gas
ja: 1ガスあたりの最大優先手数料
ru: Максимальная приоритетная комиссия за газ.

source: Max of
ja: 最大値の
ru: Максимум из

source: Maximum gas amount approved for the transaction.
ja: 取引に承認された最大ガス量。
ru: Максимально допустимое количество газа для транзакции.

source: Maximum total amount per unit of gas a user is willing to pay for a transaction, including base fee and priority fee.
ja: 取引に関して、ユーザーがガスごとに支払いたい最大総額。これには基本料金と優先料金が含まれます。
ru: Максимальная общая сумма за единицу газа, которую пользователь готов заплатить за транзакцию, включая базовую плату и приоритетную плату.

source: Metadata
ja: メタデータ
ru: Метаданные

source: Method Id
ja: 方法ID
ru: Метод Id

source: Miner
ja: マイナー
ru: Шахтер (Shakhter)

source: Miner Reward
ja: マイナー報酬 (Mainā hōshū)
ru: Награда для майнера

source: Minimal Proxy Contract for
ja: 最小限のプロキシ契約
ru: Минимальный контракт-посредник для

source: Minimum fee required per unit of gas. Fee adjusts based on network congestion.
ja: ガスの単位あたりに必要な最低料金です。ネットワークの混雑状態に応じて料金が調整されます。
ru: Минимальная плата, необходимая за единицу газа. Плата регулируется в зависимости от загруженности сети.

source: Model
ja: モデル
ru: Модель

source: More internal transactions have come in
ja: もっと社内取引が入ってきました。
ru: Больше внутренних операций поступило.

source: More transactions have come in
ja: もっと取引が入ってきました。
ru: Больше транзакций поступило.

source: Must be set to:
ja: 設定しなければなりません：
ru: Должно быть установлено на:

source: Must match the name specified in the code. For example, in <span class="tooltip-quote">contract MyContract {..}</span> <strong>MyContract</strong> is the contract name.
ja: コードで指定された名前と一致する必要があります。たとえば、<span class="tooltip-quote">contract MyContract {..}</span>では、<strong>MyContract</strong>が契約名です。
ru: Должно соответствовать имени, указанному в коде. Например, в <span class="tooltip-quote">контракт MyContract {..}</span> <strong>MyContract</strong> является именем контракта.

source: N/A bytes
ja: N/A バイト
ru: Н/Д байт (N/D bayt)

source: Name
ja: 名前
ru: Имя

source: Name this API key
ja: このAPIキーに名前を付けてください。
ru: Назовите этот ключ API.

source: Name this Custom ABI
ja: このカスタムABIに名前を付けてください。
ru: Назовите этот пользовательский ABI

source: Name this address
ja: この住所に名前を付けてください。
ru: Назовите этот адрес.

source: Name this transaction
ja: この取引に名前を付けてください。
ru: Назвать эту транзакцию.

source: Net Worth
ja: 純資産価値
ru: Чистый доход.

source: New Smart Contract Verification
ja: 新しいスマート契約の検証
ru: Новая проверка умных контрактов

source: New Solidity Smart Contract Verification
ja: 新しいSolidityスマートコントラクトの検証
ru: Новая верификация умных контрактов на Solidity

source: New Solidity/Yul Smart Contract Verification
ja: 新しいSolidity/Yulスマートコントラクトの検証
ru: Новая верификация умных контрактов Solidity/Yul.

source: New Vyper Smart Contract Verification
ja: 新しいVyperスマートコントラクトの検証
ru: Новая верификация умного контракта Vyper

source: Next
ja: 次の。
ru: Следующий (or Следующая or Следующее depending on gender and number)

source: No
ja: いいえ
ru: Нет

source: No trace entries found.
ja: 痕跡の入力が見つかりませんでした。
ru: Не найдено записей о следах.

source: Nonce
ja: ノンス (Nonsu)
ru: Nonce (одноразовый)

source: Not unique Token
ja: 固有のトークンではありません。
ru: Неповторимый токен (this is a direct translation, but it's possible that a different translation might be more appropriate depending on the context).

source: Number of accounts holding the token
ja: トークンを保持しているアカウントの数
ru: Количество аккаунтов, удерживающих токен.

source: Number of blocks validated by this validator.
ja: このバリデータによって検証されたブロックの数。
ru: Количество блоков, подтвержденных этим валидатором.

source: Number of digits that come after the decimal place when displaying token value
ja: トークン値を表示する際に小数点以下に表示される桁数。
ru: Количество цифр, идущих после десятичной точки при отображении значения токена

source: Number of transactions related to this address.
ja: このアドレスに関連する取引数
ru: Количество транзакций, связанных с этим адресом

source: Number of transfers for the token
ja: トークンの転送回数
ru: Количество переводов для токена

source: Number of transfers to/from this address.
ja: このアドレスへの移動/転送回数。
ru: Количество переводов на/с этого адреса.

source: Only the first
ja: 最初だけ
ru: Только первый.

source: Optimization
ja: 最適化
ru: Оптимизация

source: Optimization enabled
ja: 最適化が有効になっています。
ru: Оптимизация включена

source: Optimization runs
ja: 最適化実行中
ru: Оптимизационный процесс.

source: Other Explorers
ja: 他の探検家たち
ru: Другие исследователи

source: Outgoing
ja: アウトゴーイング
ru: Исходящий

source: Owner Address
ja: オーナーの住所
ru: Адрес владельца

source: POA solidity flattener or the
ja: POAのSolidityフラットナーまたはthe
ru: "Плоскостное объединение POA Solidity"

source: Page
ja: ページ
ru: Страница

source: Page not found
ja: ページが見つかりません。
ru: Страница не найдена.

source: Parameters
ja: パラメーター
ru: Параметры

source: Parent Hash
ja: 親ハッシュ
ru: Родительский хеш.

source: Pending
ja: 保留中
ru: Ожидающий

source: Pending Transactions
ja: 保留中の取引
ru: Ожидающие транзакции.

source: Play
ja: プレイする
ru: Играть

source: Please select notification methods:
ja: 通知方法を選択してください：
ru: Пожалуйста, выберите методы оповещения:

source: Please select what types of notifications you will receive:
ja: 通知の種類を選択してください：
ru: Пожалуйста, выберите, какие типы уведомлений вы хотели бы получать:

source: Position
ja: ポジション
ru: Позиция

source: Position %{index}
ja: 位置%{index}
ru: Позиция %{index}

source: Potential matches from our contract method database:
ja: 「契約方法データベースからの潜在的なマッチング候補」
ru: Возможные совпадения из нашей базы данных по контрактным методам:

source: Price
ja: 価格
ru: цена

source: Price per token on the exchanges
ja: 取引所のトークンごとの価格
ru: Цена за токен на биржах.

source: Price per unit of gas specified by the sender. Higher gas prices can prioritize transaction inclusion during times of high usage.
ja: 発信者によって指定されたガスの単位あたりの価格。高いガス価格は高負荷期におけるトランザクションの優先的な追加を可能にすることができます。
ru: Цена за единицу газа, указанная отправителем. Более высокая цена на газ может приоритезировать включение транзакции в периоды повышенного использования.

source: Priority Fee / Tip
ja: 優先料金 / チップ
ru: Приоритетная плата / Напоминание.

source: Priority Fees
ja: 優先料金
ru: Приоритетные платежи

source: Profile
ja: プロフィール
ru: Профиль

source: Public Tags
ja: 公共のタグ
ru: Общественные теги

source: Public tag
ja: 公共タグ
ru: Общественный тег

source: Public tags
ja: 公共タグ
ru: Открытые теги

source: QR Code
ja: QRコード
ru: QR-код

source: Query
ja: クエリ
ru: Запрос

source: Raw Input
ja: 生の入力
ru: Сырой ввод

source: Read Contract
ja: 契約書を読んでください。
ru: Прочитайте контракт.

source: Read Proxy
ja: 「プロキシを読む」
ru: Читать Прокси

source: Records
ja: レコード
ru: Записи

source: Remove
ja: 削除する
ru: Удалить

source: Remove from Watch list
ja: ウォッチリストから削除する
ru: Удалить из списка наблюдения

source: Request URL
ja: リクエストURL
ru: Запрос URL

source: Request a public tag/label
ja: 公的なタグ/ラベルを要求する。
ru: Запросите публичный тег/метку.

source: Request to add public tag
ja: 公共タグの追加リクエストを行います。
ru: Запрос на добавление публичного тега

source: Request to edit a public tag/label
ja: 公開タグ/ラベルの編集依頼
ru: Запрос на редактирование публичного тега/метки

source: Reset
ja: リセット
ru: Сбросить

source: Response Body
ja: レスポンスボディ
ru: Тело ответа

source: Responses
ja: 回答
ru: Ответы

source: Result
ja: 結果
ru: Результат

source: Revert reason
ja: 理由を元に戻す
ru: Причина отката

source: Reward
ja: 報酬
ru: Награда

source: Run
ja: 走る
ru: Бегать

source: Save
ja: セーブ
ru: Сохранить

source: Search
ja: 検索
ru: Поиск

source: Search Results
ja: 検索結果
ru: Результаты поиска

source: Search by address, token symbol name, transaction hash, or block number
ja: 住所、トークンシンボル名、トランザクションハッシュ、またはブロック番号で検索してください。
ru: Поиск по адресу, названию символа токена, хешу транзакции или номеру блока.

source: Search tokens
ja: トークンを検索する。
ru: Поиск токенов

source: Select Yes if you want to vefify Yul contract.
ja: ユルの契約を確認する場合は「はい」を選択してください。
ru: Выберите «Да», если вы хотите подтвердить контракт Юла.

source: Select yes if you want to show nightly builds.
ja: nightly buildsを表示したい場合は、「はい」を選択してください。
ru: Если вы хотите показать nightly builds, выберите 'да'.

source: Self-Destruct
ja: 自己破壊
ru: Саморазрушение

source: Send request
ja: リクエストを送信します。
ru: Отправить запрос

source: Server Response
ja: サーバーのレスポンス
ru: Ответ сервера

source: Show
ja: ショー
ru: Показать

source: Show QR Code
ja: QRコードを表示する。
ru: Показать QR-код.

source: Shows the current
ja: 状況を表示します。
ru: Показывает текущее.

source: Shows the tokens held in the address (includes ERC-20, ERC-721 and ERC-1155).
ja: そのアドレスに保持されているトークンを表示します（ERC-20、ERC-721、ERC-1155を含む）。
ru: Показывает токены, удерживаемые на адресе (включает ERC-20, ERC-721 и ERC-1155).

source: Shows the total CRC balance in the address.
ja: アドレスの合計CRC残高を表示します。
ru: Показывает общий баланс CRC на адресе.

source: Shows total assets held in the address
ja: アドレスに保有されている総資産を表示します。
ru: Показывает общую стоимость активов, хранящихся на адресе.

source: Sign out
ja: サインアウト
ru: Выйти

source: Size
ja: サイズ
ru: Размер

source: Size of the block in bytes.
ja: ブロックのサイズ。
ru: Размер блока в байтах.

source: Smart contract / Address
ja: スマートコントラクト/アドレス
ru: Смарт-контракт / Адрес

source: Smart contract / Address (0x...)
ja: スマートコントラクト/ アドレス（0x...)
ru: Смарт-контракт / Адрес (0x...)

source: Something went wrong, click to reload.
ja: 何か問題が起こりました。再読み込みをクリックしてください。
ru: Что-то пошло не так, нажмите по-новой, чтобы перезагрузить.

source: Something went wrong, click to retry.
ja: 何か問題が発生しました。再試行するにはクリックしてください。
ru: Что-то пошло не так, нажмите для повтора.

source: Sources *.sol files
ja: ソース*.solファイル
ru: Источники *.sol файлов

source: Sources *.sol or *.yul files
ja: ソース *.sol または *.yul ファイル
ru: Источники файлов *.sol или *.yul

source: Sources and Metadata JSON
ja: ソースとメタデータJSON
ru: Источники и метаданные JSON

source: Stakes
ja: ステークス
ru: Ставки

source: Standard Input JSON
ja: 標準入力JSON
ru: Стандартный ввод JSON

source: State changes
ja: 状態変化
ru: Изменение состояний

source: Static Call
ja: 静的メソッド呼び出し
ru: Статический вызов (Static Call)

source: Status
ja: 状態
ru: Статус

source: Submission date
ja: 提出日
ru: Дата представления

source: Success
ja: 成功
ru: Успех

source: TX Fee
ja: TX手数料
ru: Комиссия TX

source: Telegram
ja: テレグラム
ru: Телеграмм

source: Test Networks
ja: テストネットワーク。
ru: Тестовые сети

source: The 0x library address. This can be found in the generated json file or Truffle output (if using truffle).
ja: 0xライブラリのアドレス。これは生成されたJSONファイルまたはTruffleの出力（Truffleを使用している場合）で見つけることができます。
ru: Адрес библиотеки 0x. Его можно найти в сгенерированном файле JSON или в выводе Truffle (если используется Truffle).

source: The EVM version the contract is written for. If the bytecode does not match the version, we try to verify using the latest EVM version.
ja: 契約に書かれているEVMバージョン。バイトコードが一致しない場合、最新のEVMバージョンを使用して検証を試みます。
ru: Версия EVM, для которой написан контракт. Если байт-код не соответствует версии, мы пытаемся проверить его с использованием последней версии EVM.

source: The SHA256 hash of the block.
ja: ブロックのSHA256ハッシュ。
ru: Хэш блока SHA256.

source: The block height of a particular block is defined as the number of blocks preceding it in the blockchain.
ja: 特定のブロックのブロック高は、ブロックチェーンに先立つブロックの数と定義されます。
ru: Высота конкретного блока определяется как количество блоков, предшествующих ему в блокчейне.

source: The changes from this transaction have not yet happened since the transaction is still pending.
ja: この取引からの変更は、取引がまだ保留中であるため、まだ発生していません。
ru: Изменения от этой транзакции еще не произошли, так как транзакция все еще ожидает выполнения.

source: The compiler version is specified in <span class="tooltip-quote">pragma solidity X.X.X</span>. Use the compiler version rather than the nightly build. If using the Solidity compiler, run <span class="tooltip-quote">solc —version</span> to check.
ja: コンパイラバージョンは <span class="tooltip-quote">pragma solidity X.X.X</span> で指定されます。ナイトリービルドではなく、コンパイラバージョンを使用してください。 Solidityコンパイラを使用する場合は、 <span class="tooltip-quote">solc —version</span> を実行して確認してください。
ru: Версия компилятора указывается в <span class="tooltip-quote">pragma solidity X.X.X</span>. Используйте версию компилятора, а не ночную сборку. Если вы используете компилятор Solidity, запустите <span class="tooltip-quote">solc —version</span>, чтобы проверить.

source: The fallback function is executed on a call to the contract if none of the other functions match the given function signature, or if no data was supplied at all and there is no receive Ether function. The fallback function always receives data, but in order to also receive Ether it must be marked payable.
ja: フォールバック関数は、他の関数のシグネチャーに一致しない場合、またはデータが提供されず、リシーブイーサ関数が存在しない場合に、コントラクトに呼び出されると実行されます。フォールバック関数は常にデータを受け取りますが、イーサも受け取るにはペイアブルである必要があります。
ru: Функция отката выполняется при вызове контракта, если ни одна из других функций не соответствует заданной сигнатуре функции, или если не было предоставлено никаких данных и нет функции получения Ether. Функция отката всегда получает данные, но для получения Ether ее нужно пометить как payable.

source: The hash of the block from which this block was generated.
ja: このブロックが生成された元のブロックのハッシュ。
ru: Хеш блока, из которого был создан данный блок.

source: The name found in the source code of the Contract.
ja: 契約のソースコードに見つかる名前。
ru: Название, найденное в исходном коде контракта.

source: The name of the validator.
ja: バリデーターの名前。
ru: Имя валидатора.

source: The number of transactions in the block.
ja: ブロック内の取引の数。
ru: Количество транзакций в блоке.

source: The receive function is executed on a call to the contract with empty calldata. This is the function that is executed on plain Ether transfers (e.g. via .send() or .transfer()). If no such function exists, but a payable fallback function exists, the fallback function will be called on a plain Ether transfer. If neither a receive Ether nor a payable fallback function is present, the contract cannot receive Ether through regular transactions and throws an exception.
ja: receive関数は、空のcalldataでコントラクトを呼び出すと実行されます。これは、プレーンなEtherの送金（例：.send（）または.transfer（）を使用して）で実行される関数です。このような関数が存在しない場合、有償のフォールバック関数が存在する場合、プレーンなEther転送時にフォールバック関数が呼び出されます。もし、Etherの受け取りができるreceive Ether関数と有償のフォールバック関数のどちらも存在しない場合、コントラクトは通常のトランザクションを通じてEtherを受け取ることができず、例外をスローします。
ru: Функция receive выполняется при вызове контракта с пустыми calldata. Это функция, которая выполняется при обычных переводах Ether (например, через .send() или .transfer()). Если такой функции не существует, но существует функция fallback, которую можно оплатить (payable fallback function), на обычный перевод Ether будет вызвана именно она. Если ни функция приема Ether, ни функция fallback, которую можно оплатить, не существуют, контракт не может принимать Ether через обычные транзакции и генерирует исключение.

source: The revert reason of the transaction.
ja: 取引の返還理由。
ru: Причина отката транзакции.

source: The status of the transaction: Confirmed or Unconfirmed.
ja: 取引の状況：確認済みまたは未確認。
ru: Статус транзакции: подтвержден или неподтвержден.

source: The total amount of tokens issued
ja: 発行されたトークンの総数
ru: Общее количество выпущенных токенов

source: The total gas amount used in the block and its percentage of gas filled in the block.
ja: ブロックで使用された合計ガス量と、ブロックに充填されたガスの割合。
ru: Общее количество газа, использованного в блоке и его процент содержания газа в блоке.

source: There are no blocks validated by this address.
ja: このアドレスでは検証されたブロックはありません。
ru: Нет ни одного блока, подтвержденного этим адресом.

source: There are no blocks.
ja: ブロックはありません。
ru: Нет блоков.

source: There are no holders for this Token.
ja: このトークンにはホルダーがいません。
ru: Нет держателей для этого токена.

source: There are no internal transactions for this address.
ja: このアドレスには内部取引はありません。
ru: Для этого адреса нет внутренних транзакций.

source: There are no internal transactions for this transaction.
ja: この取引には内部取引はありません。
ru: Для этой транзакции нет внутренних операций.

source: There are no logs for this address.
ja: このアドレスにはログがありません。
ru: Для этого адреса нет журналов.

source: There are no logs for this transaction.
ja: この取引にはログがありません。
ru: Для этой транзакции нет журналов.

source: There are no pending transactions.
ja: 保留中の取引はありません。
ru: Нет незавершенных транзакций.

source: There are no token transfers for this address.
ja: このアドレスへのトークン転送はありません。
ru: На этот адрес нет переводов токенов.

source: There are no token transfers for this transaction
ja: このトランザクションにはトークン転送はありません。
ru: Для этой транзакции нет передач токенов.

source: There are no tokens for this address.
ja: このアドレスにはトークンがありません。
ru: Для этого адреса нет токенов.

source: There are no tokens.
ja: トークンはありません。
ru: Нет токенов.

source: There are no transactions for this address.
ja: このアドレスには取引がありません。
ru: Для этого адреса нет транзакций.

source: There are no transactions for this block.
ja: このブロックにおいて、取引はありません。
ru: На этот блок нет транзакций.

source: There are no transactions.
ja: 取引はありません。
ru: Нет транзакций.

source: There are no transfers for this Token.
ja: このトークンには転送がありません。
ru: Нет трансферов для этого токена.

source: There are no verified contracts.
ja: 検証済みの契約はありません。
ru: Нет подтвержденных контрактов.

source: There is no coin history for this address.
ja: このアドレスにはコインの履歴がありません。
ru: Нет истории монет для этого адреса.

source: There is no decompilded contracts for this address.
ja: このアドレスには脱コンパイルされた契約はありません。
ru: Для этого адреса нет декомпилированных контрактов.

source: There was a problem loading the chart.
ja: グラフを読み込む際に問題が発生しました。
ru: Произошла ошибка при загрузке диаграммы.

source: This API is provided for developers transitioning their applications from Etherscan to BlockScout. It supports GET and POST requests.
ja: これは、EtherscanからBlockScoutにアプリケーションを移行する開発者向けに提供されるAPIです。GETリクエストとPOSTリクエストの両方をサポートしています。
ru: Это API предоставляется разработчикам, переходящим от Etherscan к BlockScout. Он поддерживает запросы GET и POST.

source: This API is provided to support some rpc methods in the exact format specified for ethereum nodes, which can be found
ja: このAPIは、Ethereumノードで指定された正確なフォーマットでいくつかのrpcメソッドをサポートするために提供されています。
ru: Этот API предоставляется в поддержку некоторых методов rpc в точном формате, указанном для узлов ethereum, которые могут быть найдены.

source: This block has not been processed yet.
ja: このブロックはまだ処理されていません。
ru: Этот блок ещё не был обработан.

source: This contract has been partially verified via Sourcify.
ja: この契約はSourcifyを介して部分的に検証されました。
ru: Этот контракт частично проверен с помощью Sourcify.

source: This contract has been verified via Sourcify.
ja: この契約はSourcifyによって検証されました。
ru: Этот контракт был проверен через Sourcify.

source: This is useful to allow sending requests to blockscout without having to change anything about the request.
ja: この機能は、リクエスト自体に変更を加えることなくブロックスカウトにリクエストを送信することができるため、便利です。
ru: Это полезно для разрешения отправки запросов на blockscout без необходимости изменения чего-либо в запросе.

source: This transaction hasn't changed state.
ja: このトランザクションは状態が変わっていません。
ru: Эта транзакция не изменила свое состояние.

source: This transaction is pending confirmation.
ja: この取引は確認待ちです。
ru: Эта транзакция ожидает подтверждения.

source: Timestamp
ja: タイムスタンプ
ru: Метка времени

source: To
ja: すると
ru: Для

source: To have guaranteed accuracy, use the link above to verify the contract's source code.
ja: 保証された正確性を得るために、契約のソースコードを確認するために上記のリンクを使用してください。
ru: Чтобы обеспечить гарантированную точность, используйте ссылку выше, чтобы проверить исходный код контракта.

source: To see accurate decoded input data, the contract must be verified.
ja: 正確な復号化された入力データを見るには、契約が検証される必要があります。
ru: Чтобы увидеть точные расшифрованные входные данные, контракт должен быть проверен.

source: Toggle navigation
ja: トグルナビゲーション
ru: Переключить навигацию

source: Token
ja: トークン
ru: Токен

source: Token Burning
ja: トークンの焼却
ru: Сжигание токенов

source: Token Creation
ja: トークン作成
ru: Создание токена

source: Token Details
ja: トークンの詳細
ru: Детали токена

source: Token Holders
ja: トークン保有者
ru: Владельцы токенов

source: Token ID
ja: トークンID
ru: Идентификатор токена.

source: Token Minting
ja: トークンの鋳造
ru: Токенизация.

source: Token Transfer
ja: トークンの転送
ru: Передача токенов

source: Token Transfers
ja: トークン転送
ru: Перевод текста на русский язык: Передача токенов

source: Token Transfers(ERC20)
ja: トークン転送（ERC20）
ru: Трансферы токенов (ERC20)

source: Token name and symbol.
ja: トークン名とシンボル。
ru: Название и символ токена.

source: Token type
ja: トークンの種類
ru: Тип токена

source: Tokens
ja: トークン
ru: Токены

source: Tokens Burnt
ja: トークンが焼却されました。
ru: Монеты сожжены

source: Tokens Created
ja: トークンが作成されました。
ru: Жетоны созданы.

source: Tokens Minted
ja: トークンが鋳造されました。
ru: Жетоны выпущены.

source: Tokens Transferred
ja: トークンが転送されました。
ru: Токены переведены.

source: Top Accounts - %{subnetwork} Explorer
ja: トップアカウント - %{subnetwork} Explorer
ru: Топ аккаунты - %{subnetwork} Исследователь

source: Topic
ja: トピック
ru: Тема

source: Topics
ja: トピックス
ru: Темы

source: Total
ja: 合計
ru: Общий

source: Total Difficulty
ja: 総難易度 (そうなんいど)
ru: Общая сложность

source: Total Supply * Price
ja: トータルサプライ×価格
ru: Общее предложение * Цена

source: Total blocks
ja: 合計ブロック数
ru: Общее количество блоков

source: Total difficulty of the chain until this block.
ja: このブロックまでのチェーンの総難易度。
ru: Общая сложность цепочки до этого блока.

source: Total gas limit provided by all transactions in the block.
ja: ブロック内のすべての取引で提供される合計ガスリミット。
ru: Общий лимит газа, предоставленный всеми транзакциями в блоке.

source: Total supply
ja: 合計の供給量
ru: Общее количество

source: Total transaction fee.
ja: トータル取引手数料。
ru: Общая комиссия за транзакцию.

source: Total transactions
ja: 総トランザクション数
ru: Общее количество транзакций.

source: Transaction
ja: トランザクション
ru: Транзакция

source: Transaction %{transaction} - %{subnetwork} Explorer
ja: 取引%{transaction} - %{subnetwork}エクスプローラー
ru: Транзакция %{transaction} - %{subnetwork} Explorer

source: Transaction %{transaction}, %{subnetwork} %{transaction}
ja: トランザクション%{transaction}、%{subnetwork} %{transaction}
ru: Транзакция %{transaction}, %{subnetwork} %{transaction}

source: Transaction Burnt Fee
ja: トランザクション消費手数料
ru: Транзакционная комиссия, сжженная в процессе сделки.

source: Transaction Details
ja: 取引詳細
ru: Детали транзакции

source: Transaction Fee
ja: 取引手数料 (Torihiki Tesuryō)
ru: Комиссия за транзакцию

source: Transaction Hash
ja: トランザクションハッシュ
ru: Хэш транзакции

source: Transaction Inputs
ja: トランザクション入力
ru: Входы транзакции (Literal translation: Inputs of the transaction)

source: Transaction Tags
ja: 取引タグ
ru: Теги транзакций

source: Transaction Type
ja: 取引タイプ
ru: Тип транзакции

source: Transaction number from the sending address. Each transaction sent from an address increments the nonce by 1.
ja: 送信アドレスからの取引番号。1つのアドレスから送信される取引ごとにnonceが1増加します。
ru: Номер транзакции от отправляющего адреса. Каждая транзакция, отправленная с адреса, увеличивает значение nonce на 1.

source: Transaction type, introduced in EIP-2718.
ja: EIP-2718で導入された取引タイプ。
ru: Тип транзакции, представленный в EIP-2718.

source: Transactions
ja: 取引
ru: Транзакции

source: Transactions and address of creation.
ja: 取引と作成アドレス。
ru: Транзакции и адрес создания.

source: Transactions sent
ja: トランザクションが送信されました。
ru: Транзакции отправлены

source: Transfers
ja: 転送
ru: Переводы

source: Try it out
ja: 試してみてください。
ru: Попробуй это

source: Try to fetch constructor arguments automatically
ja: 自動的にコンストラクタ引数を取得しようとしてください。
ru: Попробуйте автоматически извлечь аргументы конструктора.

source: Twitter
ja: ツイッター
ru: Твиттер

source: Tx/Day
ja: 一日あたり Tx

source: Txns
ja: 取引
ru: Транзакции
