Repository: xweb3/blockscout
Catalog: apps/block_scout_web/priv/gettext/*/LC_MESSAGES/default.po
Languages: ja, ru

source: %{count} token
ja: %{count} トークン

source: %{count} transaction
ja: %{count} トランザクション

source: - minimal bytecode implementation that delegates all calls to a known address
ja: 既知のアドレスにすべての呼び出しを委任する最小のバイトコード実装
ru: минимальная реализация байткода, которая делегирует все вызовы на известный адрес

source: is recommended.
ja: お勧めされます。
ru: рекомендуется.

source: %{address} - %{subnetwork} Explorer
ja: %{address} - %{subnetwork} エクスプローラー
ru: %{address} - Просмотрщик %{subnetwork}

source: %{block_type} Details
ja: %{block_type}詳細
ru: Детали %{block_type}

source: %{block_type} Height
ja: %{block_type} 高さ
ru: Высота блока %{block_type}

source: %{count} Transaction
ja: %{count} 取引
ru: %{count} Транзакция

source: %{count} Transactions
ja: %{count} トランザクション
ru: %{count} транзакций

source: %{subnetwork} Explorer - BlockScout
ja: %{subnetwork} エクスプローラー - BlockScout
ru: Проводник %{subnetwork} - BlockScout

source: (Awaiting internal transactions for status)
ja: （状態の内部取引を待っています）
ru: Ожидаются внутренние транзакции для статуса.

source: ) may be added for each contract. Click the Add Library button to add an additional one.
ja: 契約ごとに1つのライブラリが追加される場合があります。追加するには「ライブラリを追加」ボタンをクリックしてください。
ru: Для каждого контракта может быть добавлено несколько библиотек. Нажмите кнопку Добавить библиотеку, чтобы добавить дополнительную.

source: 64-bit hash of value verifying proof-of-work (note: null for POA chains).
ja: 値の64ビットハッシュは、作業の証明を検証します（注：POAチェーンの場合はnull）。
ru: 64-битный хеш значения, подтверждающий доказательство выполнения работы (примечание: для цепочек POA - null).

source: A block producer who successfully included the block onto the blockchain.
ja: ブロックをブロックチェーンに正常に含めたブロックプロデューサー。
ru: Производитель блоков, который успешно включил блок в блокчейн.

source: A library name called in the .sol file. Multiple libraries (up to
ja: A .solファイル内で呼び出されるライブラリの名前。複数のライブラリ（最大で
ru: Файл .sol имеет название библиотеки. Возможно использование нескольких библиотек (до...)

source: A string with the name of the action to be invoked.
ja: 呼び出すアクションの名前を示す文字列。
ru: Строка с именем действия, которое нужно вызвать.

source: A string with the name of the module to be invoked.
ja: 呼び出すモジュールの名前を持つ文字列。
ru: Строка с названием модуля, который должен быть вызван.

source: ABI-encoded Constructor Arguments (if required by the contract)
ja: ABIエンコードされたコンストラクタ引数（コントラクトで必要な場合）
ru: Аргументы конструктора, закодированные в формате ABI (если требуется контрактом)

source: API Documentation
ja: APIドキュメント
ru: Документация API

source: API endpoints for the %{subnetwork}
ja: 以下は、日本語への翻訳です。「%{subnetwork} のAPIエンドポイント」
ru: API конечные точки для %{subnetwork}

source: API for the %{subnetwork} - BlockScout
ja: サブネットワークのためのAPI - BlockScout
ru: API для %{подсеть} - BlockScout.

source: API key
ja: APIキー
ru: Ключ API

source: API keys
ja: APIキー
ru: API ключи

source: Actions
ja: 行動
ru: Действия

source: Actual gas amount used by the transaction.
ja: 取引で使用された実際のガス量。
ru: Фактическое количество газа, использованное в транзакции.

source: Add
ja: 追加する
ru: Добавить

source: Add API key
ja: APIキーを追加してください。
ru: Добавить API ключ

source: Add Contract Libraries
ja: 契約図書館を追加する。
ru: Добавить библиотеки контрактов.

source: Add Custom ABI
ja: カスタムABIを追加する
ru: Добавьте настраиваемый ABI.

source: Add Library
ja: ライブラリを追加する
ru: Добавить библиотеку

source: Add address
ja: 住所を追加してください。
ru: Добавить адрес

source: Add address tag
ja: 住所タグを追加してください。
ru: Добавьте тег адреса.

source: Add address to the Watch list
ja: 「ウォッチリストに住所を追加してください。」
ru: Добавить адрес в список наблюдаемых.

source: Add transaction tag
ja: 取引タグを追加してください。
ru: Добавить тег транзакции.

source: Address
ja: 住所
ru: Адрес

source: Address (external or contract) receiving the transaction.
ja: トランザクションを受け取るアドレス（外部または契約）。
ru: Адрес (внешний или контракт) получения транзакции.

source: Address (external or contract) sending the transaction.
ja: 取引を送信するアドレス（外部または契約）。
ru: Адрес (внешний или контрактный), отправляющий транзакцию.

source: Address Tags
ja: 住所タグ
ru: Адресные теги (Address Tags)

source: Address balance in
ja: アドレスバランスについて考える
ru: Баланс адреса в

source: Address of the token contract
ja: トークン契約のアドレス
ru: Адрес контракта токена

source: Address used in token mintings and burnings.
ja: トークンの発行と焼却に使用されるアドレス。
ru: Адрес, используемый при создании и сжигании токенов.

source: Address*
ja: 住所*
ru: Адрес*

source: Addresses
ja: 住所 (じゅうしょ)
ru: Адреса

source: All
ja: すべて
ru: Все

source: All functions displayed below are from ABI of that contract. In order to verify current contract, proceed with
ja: 下に表示されているすべての機能は、その契約のABIからです。現在の契約を確認するには、次の手順を実行してください。
ru: Все функции, отображенные ниже, относятся к ABI этого контракта. Для проверки текущего контракта продолжите.

source: All metadata displayed below is from that contract. In order to verify current contract, click
ja: 以下に表示されるすべてのメタデータはその契約からのものです。現在の契約を確認するには、クリックしてください。
ru: Все метаданные, отображенные ниже, относятся к этому контракту. Чтобы подтвердить текущий контракт, нажмите.

source: All tokens in the account and total value.
ja: アカウント内のすべてのトークンと総価値。
ru: Все токены на счете и общая стоимость.

source: Amount of
ja: 金額 (kinkou)
ru: Количество

source: Amount of distributed reward. Miners receive a static block reward + Tx fees + uncle fees.
ja: 分配報酬の量。マイナーは、固定ブロック報酬+Tx手数料+叔父手数料を受け取ります。
ru: Количество распределяемой награды. Майнеры получают статическую блоковую награду + комиссии за транзакции + комиссии за неудачные блоки.

source: Anything not in this list is not supported. Click on the method to be taken to the documentation for that method, and check the notes section for any potential differences.
ja: このリストにないものはサポートされていません。メソッドをクリックしてそのメソッドのドキュメントに移動し、ポテンシャルの違いについては注意事項を確認してください。
ru: Все, что не указано в этом списке, не поддерживается. Нажмите на метод, чтобы перейти к документации по этому методу и проверьте раздел заметок на наличие возможных отличий.

source: Apps
ja: アプリ
ru: Приложения

source: Back to API keys (Cancel)
ja: APIキーに戻る（キャンセル）
ru: Назад к ключам API (Отменить)

source: Back to Address Tags (Cancel)
ja: アドレスタグに戻る（キャンセル）
ru: Назад к тегам адреса (Отменить)

source: Back to Custom ABI (Cancel)
ja: カスタムABIに戻る (キャンセル)
ru: Возврат к Custom ABI (Отмена)

source: Back to Transaction Tags (Cancel)
ja: トランザクションタグに戻る（キャンセル）
ru: Вернуться к тегам транзакций (отмена)

source: Back to Watch list (Cancel)
ja: ウォッチリストに戻る（キャンセル）
ru: Вернуться в список наблюдения (Отмена)

source: Balance
ja: バランス (Baransu)
ru: Баланс

source: Balance after
ja: Balance after: 残高後
ru: Баланс после

source: Balance before
ja: 前にバランスを取る (Maeni Baransu o toru)
ru: Баланс до

source: Balances
ja: 残高
ru: Остатки.

source: Base Fee per Gas
ja: ガスごとの基本料金
ru: Базовая плата за газ.

source: Base URL:
ja: ベースURL：
ru: Базовый URL:

source: Binary data included with the transaction. See input / logs below for additional info.
ja: トランザクションに含まれるバイナリデータ。詳細情報については、以下の入力/ログを参照してください。
ru: Двоичные данные включены в транзакцию. Смотрите ввод / журналы ниже для дополнительной информации.

source: Block
ja: ブロック
ru: Блок

source: Block #%{number}
ja: ブロック #%{number}
ru: Блок #%{number}

source: Block %{block_number} - %{subnetwork} Explorer
ja: ブロック %{block_number} - %{subnetwork} Explorer
ru: Блок %{block_number} - исследователь %{subnetwork}

source: Block Details
ja: ブロックの詳細
ru: Детали блока

source: Block Height
ja: ブロック高さ
ru: Высота блока

source: Block Mined, awaiting import...
ja: ブロックが採掘されました。インポート待ちです。
ru: Блок добыт, ожидает импорта...

source: Block Pending
ja: 保留中のブロック
ru: Блокировка в ожидании.

source: Block difficulty for miner, used to calibrate block generation time (Note: constant in POA based networks).
ja: マイナーのためのブロックの難易度は、ブロック生成時間を調整するために使用されます（注：POAベースのネットワークでは一定です）。
ru: Сложность блоков для майнера, используется для калибровки времени генерации блока (Примечание: постоянная в сетях на основе POA).

source: Block not found, please try again later.
ja: ブロックが見つかりませんでした。後でもう一度お試しください。
ru: Блок не найден, пожалуйста, попробуйте позже.

source: Block number containing the transaction.
ja: 取引を含むブロック番号。
ru: Номер блока, содержащий транзакцию.

source: Block number in which the address was updated.
ja: アドレスが更新されたブロック番号。
ru: Номер блока, в котором был обновлен адрес.

source: Blocks
ja: ブロック
ru: Блоки

source: Blocks Indexed
ja: ブロックがインデックス化されました。
ru: Блоки индексированы

source: Blocks Validated
ja: ブロックが検証されました。
ru: Блоки проверены

source: Blocks With Internal Transactions Indexed
ja: 内部トランザクションがインデックス化されたブロック。
ru: Блоки с индексированными внутренними транзакциями

source: Burn address
ja: バーンアドレス
ru: Адрес сжигания

source: Burnt Fees
ja: 焦げた手数料
ru: Сожженные комиссии

source: CRC Worth
ja: CRCワース
ru: CRC стоит.

source: Call
ja: コール
ru: Звонок

source: Call Code
ja: コールコード
ru: Код вызова

source: Cancel
ja: キャンセル
ru: Отменить

source: Change
ja: 変化 (Henka)
ru: Изменение

source: Chore Reward
ja: 家事報酬
ru: Награда за выполнение домашних дел

source: Clear
ja: クリア
ru: Ясно

source: Close
ja: 閉める
ru: Закрыть

source: Code
ja: コード
ru: Код

source: Coin Balance History
ja: コイン残高履歴
ru: История баланса монет.

source: Withdraw
ja: 引き出す
ru: Вывести

source: Deposit
ja: 入金
ru: Депозит

source: Collapse
ja: 崩壊
ru: Крах

source: Company name
ja: 会社名 (Kaishamei)
ru: : Название компании

source: Company website
ja: 会社のウェブサイト
ru: Корпоративный веб-сайт

source: Compiler
ja: コンパイラー
ru: Компилятор

source: Compiler Settings
ja: コンパイラの設定
ru: Настройки компилятора

source: Compiler version
ja: コンパイラのバージョン
ru: Версия компилятора

source: Confirmed
ja: 確認済み (Kakunin Zumari)
ru: Подтверждено

source: Confirmed by
ja: 確認されました。
ru: Подтверждено.

source: Confirmed within
ja: 確認済み
ru: Подтверждено в пределах.

source: Connection Lost
ja: 接続が切断されました。
ru: Соединение потеряно.

source: Connection Lost, click to load newer blocks
ja: 接続が切断されました。新しいブロックを読み込むにはクリックしてください。
ru: Соединение потеряно, нажмите для загрузки новых блоков.

source: Connection Lost, click to load newer internal transactions
ja: 接続が失われました。最新の内部取引を読み込むにはクリックしてください。
ru: Потеряно соединение, нажмите, чтобы загрузить более новые внутренние транзакции.

source: Connection Lost, click to load newer transactions
ja: 接続が失われました。より新しい取引を読み込むにはクリックしてください。
ru: Потеряно соединение, нажмите, чтобы загрузить более новые транзакции.

source: Connection Lost, click to load newer validations
ja: 接続が切れました。新しい検証を読み込むにはクリックしてください。
ru: Соединение потеряно, нажмите для загрузки более новых проверок.

source: Constructor Arguments
ja: コンストラクタ引数
ru: Аргументы конструктора.

source: Constructor args
ja: コンストラクタ引数
ru: Аргументы конструктора.

source: Contract
ja: 契約
ru: Контракт

source: Contract ABI
ja: 契約ABI
ru: Контракт ABI (Application Binary Interface)

source: Contract Address
ja: 契約アドレス
ru: Адрес контракта

source: Contract Address Pending
ja: 契約アドレス保留中
ru: Адрес контракта ожидается.

source: Contract Call
ja: 契約コール
ru: Контрактный вызов

source: Contract Creation
ja: 契約作成
ru: Создание контракта

source: Contract Creation Code
ja: 契約作成コード
ru: Код создания контракта

source: Contract Libraries
ja: 契約図書館
ru: Контрактные библиотеки

source: Contract Name
ja: 契約名
ru: Название договора

source: Contract is not verified. However, we found a verified contract with the same bytecode in Blockscout DB
ja: 契約は検証されていません。しかし、Blockscout DBで同じバイトコードを持つ検証された契約を見つけました。
ru: Контракт не подтвержден. Тем не менее, мы нашли подтвержденный контракт с тем же байткодом в базе данных Blockscout.

source: Contract name or address
ja: 契約名または住所
ru: Название контракта или адрес

source: Contract name:
ja: 契約名：
ru: Название контракта:

source: Contract source code
ja: 契約元のソースコード
ru: Контрактный исходный код

source: Contract was precompiled and created at genesis
ja: 契約はジェネシスで事前にコンパイルされ、作成されました。
ru: Контракт был предварительно скомпилирован и создан в генезисе.

source: Contracts
ja: 契約
ru: Контракты

source: Contracts that self destruct in their constructors have no contract code published and cannot be verified.
ja: 自己破壊する契約のコントラクトはコントラクトコードが公開されず、検証できません。
ru: Контракты, которые самоуничтожаются в своих конструкторах, не имеют опубликованного кода контракта и не могут быть проверены.

source: Copy ABI
ja: ABI をコピーする
ru: Скопировать ABI

source: Copy API key
ja: APIキーをコピーする。
ru: Скопируйте ключ API.

source: Copy Address
ja: 住所をコピーする。
ru: Скопировать адрес

source: Copy Compiler Settings
ja: コンパイラ設定をコピーする。
ru: Скопировать настройки компилятора.

source: Copy Contract Address
ja: コピー契約アドレス
ru: Скопировать адрес контракта.

source: Copy Contract Creation Code
ja: コピー契約作成コード
ru: Скопируйте код создания контракта

source: Copy Decompiled Contract Code
ja: コピーされた逆コンパイルされた契約コード
ru: Скопируйте декомпилированный код контракта.

source: Copy Deployed ByteCode
ja: コピー配布されたバイトコード
ru: Копирование развернутого байт-кода.

source: Copy From Address
ja: アドレスからコピー
ru: Скопировать из адреса

source: Copy Hash
ja: コピー ハッシュ
ru: Скопировать хэш

source: Copy Metadata
ja: メタデータをコピーする
ru: Копировать метаданные

source: Copy Parent Hash
ja: コピー元ハッシュ
ru: Скопируйте хеш-родителя

source: Copy Raw Trace
ja: コピー Raw Trace
ru: копировать Raw Trace

source: Copy Source Code
ja: ソースコードをコピーする
ru: Скопировать исходный код

source: Copy To Address
ja: 宛先にコピー
ru: Копировать в адрес

source: Copy Token ID
ja: トークンIDをコピーする
ru: Скопировать идентификатор токена

source: Copy Transaction Hash
ja: トランザクションハッシュをコピーする。
ru: Скопируйте хеш транзакции

source: Copy Txn Hash
ja: トランザクションハッシュをコピーする
ru: Скопировать хэш транзакции

source: Copy Txn Hex Input
ja: コピー取引16進入力
ru: Скопируйте шестнадцатеричный ввод Транзакции

source: Copy Txn UTF-8 Input
ja: コピー 取引 UTF-8 入力
ru: Скопировать Транзакции UTF-8 ввод

source: Copy Value
ja: コピー値
ru: Скопировать значение

source: Create
ja: 作成する
ru: Создать

source: Create a Custom ABI to interact with contracts.
ja: 契約とのやり取りをするためのカスタムABIを作成してください。
ru: Создайте пользовательский ABI для взаимодействия с контрактами.

source: Create an API key to use with your RPC и EthRPC API requests.
ja: RPC и EthRPC API リクエストで使用するAPIキーを作成してください。
ru: Создайте ключ API для использования в ваших запросах к RPC и EthRPC API.

source: Create2
ja: Create2を日本語に訳す。
ru: Создать2

source: Creator
ja: 創造者
ru: Создатель

source: Curl
ja: カール
ru: Кудрявость

source: Current transaction state: Success, Failed (Error), or Pending (In Process)
ja: 現在の取引状態：成功、失敗（エラー）、または保留中（処理中）
ru: Текущее состояние транзакции: Успешно, Ошибка или В ожидании (В процессе)

source: Custom
ja: カスタム
ru: Кастомизация

source: Custom ABI
ja: カスタムABI
ru: Настраиваемый ABI

source: Custom ABI from account
ja: アカウントからカスタムABI
ru: Пользовательский ABI от аккаунта

source: Daily Txn Volume
ja: 毎日の取引量

source: 24H Txn Volume
ja: 24時間の取引量

source: Daily Transactions
ja: 日々の取引
ru: Ежедневные транзакции.

source: Data
ja: データ
ru: Данные

source: Date & time at which block was produced.
ja: ブロックが生成された日時。
ru: Дата и время, когда был создан блок.

source: Date & time of transaction inclusion, including length of time for confirmation.
ja: 取引が含まれる日付と時刻、確認に必要な時間の長さを含みます。
ru: Дата и время включения транзакции, включая время подтверждения.

source: Decimals
ja: 小数点
ru: Десятичные числа

source: Decoded
ja: デコードされました
ru: Декодировано

source: Decompiled Code
ja: 逆コンパイルされたコード
ru: Декомпилированный код

source: Decompiled code
ja: デコンパイルされたコード
ru: Декомпилированный код

source: Decompiled contract code
ja: デコンパイルされた契約コード
ru: Декомпилированный код контракта.

source: Decompiler version
ja: デコンパイラーバージョン
ru: Версия декомпилятора

source: Delegate Call
ja: デリゲートコール
ru: Делегированный вызов

source: Deployed ByteCode
ja: バイトコードを展開しました。
ru: Развернутый байт-код

source: Description
ja: 説明
ru: Описание

source: Description*
ja: 説明*
ru: Описание*

source: Details
ja: 詳細
ru: Детали

source: Difficulty
ja: 難しさ
ru: Трудность

source: Displaying the init data provided of the creating transaction.
ja: 作成トランザクションの提供された初期データの表示。
ru: Отображение инициализационных данных, предоставленных при создании транзакции.

source: Download
ja: ダウンロード
ru: Загрузить

source: Drop all Solidity contract source files into the drop zone.
ja: ソリディティのすべての契約ソースファイルをドロップゾーンにドロップしてください。
ru: Перетащите все исходные файлы контрактов Solidity в зону перетаскивания.

source: Drop all Solidity or Yul contract source files into the drop zone.
ja: ソリディティまたはYulの契約ソースファイルをすべてドロップゾーンにドロップしてください。
ru: Перетащите все исходные файлы контрактов Solidity или Yul в зону перетаскивания.

source: Drop sources and metadata JSON file or click here
ja: ソースとメタデータJSONファイルをドロップするか、ここをクリックしてください。
ru: Выберите источники и JSON-файл метаданных из списка или нажмите здесь.

source: Drop sources or click here
ja: ソースをドロップするか、ここをクリックしてください。
ru: Выберите источники или нажмите здесь.

source: Drop the standard input JSON file or click here
ja: 標準入力JSONファイルをドロップするか、ここをクリックしてください。
ru: Перенесите стандартный входной файл JSON или нажмите здесь.

source: E-mail*
ja: Eメール*
ru: Электронная почта

source: ERC-20 tokens (beta)
ja: ERC-20 トークン (ベータ版)
ru: ERC-20 токены (бета-версия)

source: ERC-721, ERC-1155 tokens (NFT) (beta)
ja: ERC-721、ERC-1155トークン（NFT）（ベータ版）
ru: ERC-721, ERC-1155 токены (NFT) (бета-версия)

source: ETH RPC API Documentation
ja: ETH RPC API ドキュメンテーション
ru: Документация ETH RPC API.

source: EVM Version
ja: EVMバージョン
ru: Версия ЭВМ

source: EVM version details
ja: EVMバージョンの詳細
ru: Детали версии ЭВМ

source: Easy Cowboy! This block does not exist yet!
ja: イージーカウボーイ！このブロックはまだ存在しません！
ru: Легко, ковбой! Этот блок еще не существует!

source: Edit
ja: 編集する
ru: Редактировать

source: Edit Watch list address
ja: ウォッチリストのアドレスを編集する。
ru: Редактировать адрес в списке наблюдения

source: Email notifications
ja: 電子メール通知
ru: Уведомления по электронной почте

source: Emission Contract
ja: 排出契約
ru: Договор на выбросы

source: Emission Reward
ja: 排出報酬
ru: Награда за эмиссию

source: Enter the Solidity Contract Code
ja: Solidityの契約コードを入力してください。
ru: Введите код контракта Solidity.

source: Enter the Vyper Contract Code
ja: バイパー契約コードを入力してください。
ru: Введите код контракта Vyper.

source: Error
ja: エラー
ru: Ошибка

source: Error in internal transactions
ja: 内部取引にエラーが発生しました。
ru: Ошибка во внутренних транзакциях.

source: Error rendering value
ja: 値のレンダリングにエラーが発生しました。
ru: Ошибка при обработке значения

source: Error trying to fetch balances.
ja: 残高を取得しようとしてエラーが発生しました。
ru: Ошибка при попытке получения балансов.

source: Error: %{reason}
ja: エラー: %{reason}
ru: Ошибка: %{reason}

source: Error: (Awaiting internal transactions for reason)
ja: エラー：（理由のために内部トランザクションが待機中）
ru: Ошибка: (Ожидание внутренних транзакций по причине)

source: Example Value
ja: 例の値
ru: Примерное значение

source: Execute
ja: 実行する
ru: Выполнить

source: Expand
ja: 拡大する
ru: Расширять.

source: Export Data
ja: エクスポートデータ
ru: Экспортировать данные

source: External libraries
ja: 外部ライブラリー
ru: Внешние библиотеки.

source: Failed to decode input data.
ja: 入力データの解読に失敗しました。
ru: Не удалось декодировать входные данные.

source: Failed to decode log data.
ja: ログデータのデコードに失敗しました。
ru: Не удалось декодировать данные журнала.

source: Fetching gas used...
ja: ガス使用量の取得中...
ru: Получение использованного газа...

source: Fetching holders...
ja: ホルダーの検索中...
ru: Получение держателей...

source: Fetching tokens...
ja: トークンを取得しています...
ru: Загрузка токенов...

source: Fetching transactions...
ja: 取引を取得しています...
ru: Получение транзакций...

source: Fetching transfers...
ja: 転送を取得中...
ru: Передачи извлекаются...

source: Filter by compiler:
ja: コンパイラによるフィルター：
ru: Фильтр по компилятору:

source: For any existing contracts in the database, insert all ABI entries into the contract_methods table. Use this in case you have verified smart contracts before early March 2019 and you want other contracts with the same functions to show those ABI's as candidate matches.
ja: データベース内に存在する契約に対して、すべてのABIエントリをcontract_methodsテーブルに挿入してください。これは、2019年3月初旬以前にスマートコントラクトを検証し、それと同じ機能を持つ他の契約がそのABIを候補マッチとして表示する場合に使用してください。
ru: Для всех существующих контрактов в базе данных добавьте все записи ABI в таблицу contract_methods. Используйте это, если вы проверили умные контракты до начала марта 2019 года и хотите, чтобы другие контракты с теми же функциями отображали те же ABI в качестве возможных соответствий.

source: For contract
ja: 契約に関して
ru: Для контракта

source: From
ja: から

source: Gas Limit
ja: ガスリミット
ru: Предел газа

source: Gas Price
ja: ガソリン価格
ru: Цена на газ

source: Gas Used
ja: ガスの使用
ru: Газ Использованный

source: Gas Used by Transaction
ja: 取引に使用されるガス
ru: Газ, используемый для транзакции

source: Gas Tracker
ja: モニター Gas
ru: Gas монитор

source: Gas used by the address.
ja: このアドレスで消費されるガス
ru: Газ, используемый по адресу.

source: Genesis Block
ja: ジェネシスブロック
ru: Блок Генезиса

source: Go to
ja: 行ってください。
ru: Иди в.

source: Hash
ja: ハッシュ
ru: Хэш

source: Hex (Default)
ja: ヘックス（デフォルト）
ru: Hex (По умолчанию)

source: Holders
ja: 保持者
ru: Держатели

source: However, in general, the
ja: であるが、一般的には、
ru: quality of service provided by airlines has been declining due to a variety of factors such as increasing competition, cost-cutting measures, and a focus on profitability rather than customer satisfaction. Однако, в целом, качество обслуживания, предоставляемого авиакомпаниями, снижается из-за ряда факторов, таких как увеличивающаяся конкуренция, меры по сокращению затрат и фокус на прибыльности, а не на удовлетворении потребителей.

source: IMPORTANT: This information is a best guess based on similar functions from other verified contracts.
ja: 重要：この情報は、他の検証された契約の類似機能に基づく最良の推測です。
ru: ВАЖНО: Эта информация является наилучшим предположением на основе аналогичных функций из других проверенных контрактов.

source: If you enabled optimization during compilation, select yes.
ja: もしコンパイル時に最適化を有効化した場合、はいを選択してください。
ru: Если вы включили оптимизацию во время компиляции, выберите да.

source: Implementation
ja: 実装
ru: Реализация

source: Implementation address of the proxy contract.
ja: プロキシ契約の実装アドレス。
ru: Адрес реализации контракта-прокси.

source: Include nightly builds
ja: 夜間ビルドを含めてください。
ru: Включите ежедневные сборки.

source: Incoming
ja: 到着する
ru: Входящий

source: Index position of Transaction in the block.
ja: ブロック内の取引のインデックス位置。
ru: Индекс позиции транзакции в блоке.

source: Index position(s) of referenced stale blocks.
ja: 参照された古いブロックのインデックス位置。
ru: Индексные позиции устаревших блоков, на которые ссылается.

source: Indexed?
ja: インデックス化されていますか？
ru: Индексировано?

source: Input
ja: 入力
ru: Ввод

source: Interacted With (To)
ja: 交流していました (する)
ru: Взаимодействовал(а) с

source: Internal Transaction
ja: 内部取引
ru: Внутренняя транзакция

source: Internal Transactions
ja: 内部取引
ru: Внутренние транзакции

source: Inventory
ja: 在庫管理
ru: Инвентарь

source: Is Yul contract
ja: ユルは契約していますか？
ru: Необходим перевод следующего английского текста на русский: Is Yul contract Является ли контракт Юля?

source: Last 24h
ja: 過去24時間
ru: Последние 24 часа

source: Last Balance Update
ja: 最新の残高更新
ru: Последнее обновление баланса.

source: Learn more
ja: もっと学ぶ
ru: Учиться больше.

source: Less than
ja: 以下
ru: Меньше, чем

source: Library
ja: 図書館
ru: Библиотека

source: License Expires
ja: ライセンスの有効期限が切れています。
ru: Срок действия лицензии истекает.

source: License ID
ja: ライセンスID
ru: Идентификатор лицензии

source: List of ERC-1155 tokens created in the transaction.
ja: トランザクションで作成されたERC-1155トークンのリスト。
ru: Список токенов ERC-1155, созданных в транзакции.

source: List of token burnt in the transaction.
ja: トランザクションで燃やされたトークンのリスト。
ru: Список жетонов, сожженных в транзакции.

source: List of token minted in the transaction.
ja: 取引で発行されたトークンのリスト。
ru: Список токенов, созданных в транзакции.

source: List of token transferred in the transaction.
ja: 取引で転送されたトークンのリスト。
ru: Список токенов, переведенных в транзакции.

source: Loading chart...
ja: チャートを読み込んでいます...
ru: Загрузка диаграммы...

source: Loading...
ja: ロード中...
ru: Загрузка...
